garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.inc
// Register: I2C1BTO
#define I2C1BTO I2C1BTO
I2C1BTO                                  equ 029Bh
// bitfield definitions
I2C1BTO_TOTIME_POSN                      equ 0000h
I2C1BTO_TOTIME_POSITION                  equ 0000h
I2C1BTO_TOTIME_SIZE                      equ 0006h
I2C1BTO_TOTIME_LENGTH                    equ 0006h
I2C1BTO_TOTIME_MASK                      equ 003Fh
I2C1BTO_TOBY32_POSN                      equ 0006h
I2C1BTO_TOBY32_POSITION                  equ 0006h
I2C1BTO_TOBY32_SIZE                      equ 0001h
I2C1BTO_TOBY32_LENGTH                    equ 0001h
I2C1BTO_TOBY32_MASK                      equ 0040h
I2C1BTO_TOREC_POSN                       equ 0007h
I2C1BTO_TOREC_POSITION                   equ 0007h
I2C1BTO_TOREC_SIZE                       equ 0001h
I2C1BTO_TOREC_LENGTH                     equ 0001h
I2C1BTO_TOREC_MASK                       equ 0080h
I2C1BTO_TOTIME0_POSN                     equ 0000h
I2C1BTO_TOTIME0_POSITION                 equ 0000h
I2C1BTO_TOTIME0_SIZE                     equ 0001h
I2C1BTO_TOTIME0_LENGTH                   equ 0001h
I2C1BTO_TOTIME0_MASK                     equ 0001h
I2C1BTO_TOTIME1_POSN                     equ 0001h
I2C1BTO_TOTIME1_POSITION                 equ 0001h
I2C1BTO_TOTIME1_SIZE                     equ 0001h
I2C1BTO_TOTIME1_LENGTH                   equ 0001h
I2C1BTO_TOTIME1_MASK                     equ 0002h
I2C1BTO_TOTIME2_POSN                     equ 0002h
I2C1BTO_TOTIME2_POSITION                 equ 0002h
I2C1BTO_TOTIME2_SIZE                     equ 0001h
I2C1BTO_TOTIME2_LENGTH                   equ 0001h
I2C1BTO_TOTIME2_MASK                     equ 0004h
I2C1BTO_TOTIME3_POSN                     equ 0003h
I2C1BTO_TOTIME3_POSITION                 equ 0003h
I2C1BTO_TOTIME3_SIZE                     equ 0001h
I2C1BTO_TOTIME3_LENGTH                   equ 0001h
I2C1BTO_TOTIME3_MASK                     equ 0008h
I2C1BTO_TOTIME4_POSN                     equ 0004h
I2C1BTO_TOTIME4_POSITION                 equ 0004h
I2C1BTO_TOTIME4_SIZE                     equ 0001h
I2C1BTO_TOTIME4_LENGTH                   equ 0001h
I2C1BTO_TOTIME4_MASK                     equ 0010h
I2C1BTO_TOTIME5_POSN                     equ 0005h
I2C1BTO_TOTIME5_POSITION                 equ 0005h
I2C1BTO_TOTIME5_SIZE                     equ 0001h
I2C1BTO_TOTIME5_LENGTH                   equ 0001h
I2C1BTO_TOTIME5_MASK                     equ 0020h

// Register: I2C1BAUD
#define I2C1BAUD I2C1BAUD
I2C1BAUD                                 equ 029Ch
// bitfield definitions
I2C1BAUD_BAUD_POSN                       equ 0000h
I2C1BAUD_BAUD_POSITION                   equ 0000h
I2C1BAUD_BAUD_SIZE                       equ 0008h
I2C1BAUD_BAUD_LENGTH                     equ 0008h
I2C1BAUD_BAUD_MASK                       equ 00FFh

// Register: I2C1CLK
#define I2C1CLK I2C1CLK
I2C1CLK                                  equ 029Dh
// bitfield definitions
I2C1CLK_CLK_POSN                         equ 0000h
I2C1CLK_CLK_POSITION                     equ 0000h
I2C1CLK_CLK_SIZE                         equ 0008h
I2C1CLK_CLK_LENGTH                       equ 0008h
I2C1CLK_CLK_MASK                         equ 00FFh
I2C1CLK_I2CCLK_POSN                      equ 0000h
I2C1CLK_I2CCLK_POSITION                  equ 0000h
I2C1CLK_I2CCLK_SIZE                      equ 0008h
I2C1CLK_I2CCLK_LENGTH                    equ 0008h
I2C1CLK_I2CCLK_MASK                      equ 00FFh
I2C1CLK_CLK0_POSN                        equ 0000h
I2C1CLK_CLK0_POSITION                    equ 0000h
I2C1CLK_CLK0_SIZE                        equ 0001h
I2C1CLK_CLK0_LENGTH                      equ 0001h
I2C1CLK_CLK0_MASK                        equ 0001h
I2C1CLK_CLK1_POSN                        equ 0001h
I2C1CLK_CLK1_POSITION                    equ 0001h
I2C1CLK_CLK1_SIZE                        equ 0001h
I2C1CLK_CLK1_LENGTH                      equ 0001h
I2C1CLK_CLK1_MASK                        equ 0002h
I2C1CLK_CLK2_POSN                        equ 0002h
I2C1CLK_CLK2_POSITION                    equ 0002h
I2C1CLK_CLK2_SIZE                        equ 0001h
I2C1CLK_CLK2_LENGTH                      equ 0001h
I2C1CLK_CLK2_MASK                        equ 0004h
I2C1CLK_CLK3_POSN                        equ 0003h
I2C1CLK_CLK3_POSITION                    equ 0003h
I2C1CLK_CLK3_SIZE                        equ 0001h
I2C1CLK_CLK3_LENGTH                      equ 0001h
I2C1CLK_CLK3_MASK                        equ 0008h
I2C1CLK_CLK4_POSN                        equ 0004h
I2C1CLK_CLK4_POSITION                    equ 0004h
I2C1CLK_CLK4_SIZE                        equ 0001h
I2C1CLK_CLK4_LENGTH                      equ 0001h
I2C1CLK_CLK4_MASK                        equ 0010h
I2C1CLK_I2CCLK0_POSN                     equ 0000h
I2C1CLK_I2CCLK0_POSITION                 equ 0000h
I2C1CLK_I2CCLK0_SIZE                     equ 0001h
I2C1CLK_I2CCLK0_LENGTH                   equ 0001h
I2C1CLK_I2CCLK0_MASK                     equ 0001h
I2C1CLK_I2CCLK1_POSN                     equ 0001h
I2C1CLK_I2CCLK1_POSITION                 equ 0001h
I2C1CLK_I2CCLK1_SIZE                     equ 0001h
I2C1CLK_I2CCLK1_LENGTH                   equ 0001h
I2C1CLK_I2CCLK1_MASK                     equ 0002h
I2C1CLK_I2CCLK2_POSN                     equ 0002h
I2C1CLK_I2CCLK2_POSITION                 equ 0002h
I2C1CLK_I2CCLK2_SIZE                     equ 0001h
I2C1CLK_I2CCLK2_LENGTH                   equ 0001h
I2C1CLK_I2CCLK2_MASK                     equ 0004h
I2C1CLK_I2CCLK3_POSN                     equ 0003h
I2C1CLK_I2CCLK3_POSITION                 equ 0003h
I2C1CLK_I2CCLK3_SIZE                     equ 0001h
I2C1CLK_I2CCLK3_LENGTH                   equ 0001h
I2C1CLK_I2CCLK3_MASK                     equ 0008h
I2C1CLK_I2CCLK4_POSN                     equ 0004h
I2C1CLK_I2CCLK4_POSITION                 equ 0004h
I2C1CLK_I2CCLK4_SIZE                     equ 0001h
I2C1CLK_I2CCLK4_LENGTH                   equ 0001h
I2C1CLK_I2CCLK4_MASK                     equ 0010h

// Register: I2C1BTOC
#define I2C1BTOC I2C1BTOC
I2C1BTOC                                 equ 029Eh
// bitfield definitions
I2C1BTOC_BTOC_POSN                       equ 0000h
I2C1BTOC_BTOC_POSITION                   equ 0000h
I2C1BTOC_BTOC_SIZE                       equ 0008h
I2C1BTOC_BTOC_LENGTH                     equ 0008h
I2C1BTOC_BTOC_MASK                       equ 00FFh
I2C1BTOC_I2CBTOC_POSN                    equ 0000h
I2C1BTOC_I2CBTOC_POSITION                equ 0000h
I2C1BTOC_I2CBTOC_SIZE                    equ 0008h
I2C1BTOC_I2CBTOC_LENGTH                  equ 0008h
I2C1BTOC_I2CBTOC_MASK                    equ 00FFh
I2C1BTOC_BTOC0_POSN                      equ 0000h
I2C1BTOC_BTOC0_POSITION                  equ 0000h
I2C1BTOC_BTOC0_SIZE                      equ 0001h
I2C1BTOC_BTOC0_LENGTH                    equ 0001h
I2C1BTOC_BTOC0_MASK                      equ 0001h
I2C1BTOC_BTOC1_POSN                      equ 0001h
I2C1BTOC_BTOC1_POSITION                  equ 0001h
I2C1BTOC_BTOC1_SIZE                      equ 0001h
I2C1BTOC_BTOC1_LENGTH                    equ 0001h
I2C1BTOC_BTOC1_MASK                      equ 0002h
I2C1BTOC_BTOC2_POSN                      equ 0002h
I2C1BTOC_BTOC2_POSITION                  equ 0002h
I2C1BTOC_BTOC2_SIZE                      equ 0001h
I2C1BTOC_BTOC2_LENGTH                    equ 0001h
I2C1BTOC_BTOC2_MASK                      equ 0004h
I2C1BTOC_BTOC3_POSN                      equ 0003h
I2C1BTOC_BTOC3_POSITION                  equ 0003h
I2C1BTOC_BTOC3_SIZE                      equ 0001h
I2C1BTOC_BTOC3_LENGTH                    equ 0001h
I2C1BTOC_BTOC3_MASK                      equ 0008h
I2C1BTOC_I2CBTOC0_POSN                   equ 0000h
I2C1BTOC_I2CBTOC0_POSITION               equ 0000h
I2C1BTOC_I2CBTOC0_SIZE                   equ 0001h
I2C1BTOC_I2CBTOC0_LENGTH                 equ 0001h
I2C1BTOC_I2CBTOC0_MASK                   equ 0001h
I2C1BTOC_I2CBTOC1_POSN                   equ 0001h
I2C1BTOC_I2CBTOC1_POSITION               equ 0001h
I2C1BTOC_I2CBTOC1_SIZE                   equ 0001h
I2C1BTOC_I2CBTOC1_LENGTH                 equ 0001h
I2C1BTOC_I2CBTOC1_MASK                   equ 0002h
I2C1BTOC_I2CBTOC2_POSN                   equ 0002h
I2C1BTOC_I2CBTOC2_POSITION               equ 0002h
I2C1BTOC_I2CBTOC2_SIZE                   equ 0001h
I2C1BTOC_I2CBTOC2_LENGTH                 equ 0001h
I2C1BTOC_I2CBTOC2_MASK                   equ 0004h
I2C1BTOC_I2CBTOC3_POSN                   equ 0003h
I2C1BTOC_I2CBTOC3_POSITION               equ 0003h
I2C1BTOC_I2CBTOC3_SIZE                   equ 0001h
I2C1BTOC_I2CBTOC3_LENGTH                 equ 0001h
I2C1BTOC_I2CBTOC3_MASK                   equ 0008h

// Register: I2C2RXB
#define I2C2RXB I2C2RXB
I2C2RXB                                  equ 029Fh
// bitfield definitions
I2C2RXB_RXB_POSN                         equ 0000h
I2C2RXB_RXB_POSITION                     equ 0000h
I2C2RXB_RXB_SIZE                         equ 0008h
I2C2RXB_RXB_LENGTH                       equ 0008h
I2C2RXB_RXB_MASK                         equ 00FFh

// Register: I2C2TXB
#define I2C2TXB I2C2TXB
I2C2TXB                                  equ 02A0h
// bitfield definitions
I2C2TXB_TXB_POSN                         equ 0000h
I2C2TXB_TXB_POSITION                     equ 0000h
I2C2TXB_TXB_SIZE                         equ 0008h
I2C2TXB_TXB_LENGTH                       equ 0008h
I2C2TXB_TXB_MASK                         equ 00FFh

// Register: I2C2CNT
#define I2C2CNT I2C2CNT
I2C2CNT                                  equ 02A1h

// Register: I2C2CNTL
#define I2C2CNTL I2C2CNTL
I2C2CNTL                                 equ 02A1h
// bitfield definitions
I2C2CNTL_CNT_POSN                        equ 0000h
I2C2CNTL_CNT_POSITION                    equ 0000h
I2C2CNTL_CNT_SIZE                        equ 0008h
I2C2CNTL_CNT_LENGTH                      equ 0008h
I2C2CNTL_CNT_MASK                        equ 00FFh
I2C2CNTL_CNT0_POSN                       equ 0000h
I2C2CNTL_CNT0_POSITION                   equ 0000h
I2C2CNTL_CNT0_SIZE                       equ 0001h
I2C2CNTL_CNT0_LENGTH                     equ 0001h
I2C2CNTL_CNT0_MASK                       equ 0001h
I2C2CNTL_CNT1_POSN                       equ 0001h
I2C2CNTL_CNT1_POSITION                   equ 0001h
I2C2CNTL_CNT1_SIZE                       equ 0001h
I2C2CNTL_CNT1_LENGTH                     equ 0001h
I2C2CNTL_CNT1_MASK                       equ 0002h
I2C2CNTL_CNT2_POSN                       equ 0002h
I2C2CNTL_CNT2_POSITION                   equ 0002h
I2C2CNTL_CNT2_SIZE                       equ 0001h
I2C2CNTL_CNT2_LENGTH                     equ 0001h
I2C2CNTL_CNT2_MASK                       equ 0004h
I2C2CNTL_CNT3_POSN                       equ 0003h
I2C2CNTL_CNT3_POSITION                   equ 0003h
I2C2CNTL_CNT3_SIZE                       equ 0001h
I2C2CNTL_CNT3_LENGTH                     equ 0001h
I2C2CNTL_CNT3_MASK                       equ 0008h
I2C2CNTL_CNT4_POSN                       equ 0004h
I2C2CNTL_CNT4_POSITION                   equ 0004h
I2C2CNTL_CNT4_SIZE                       equ 0001h
I2C2CNTL_CNT4_LENGTH                     equ 0001h
I2C2CNTL_CNT4_MASK                       equ 0010h
I2C2CNTL_CNT5_POSN                       equ 0005h
I2C2CNTL_CNT5_POSITION                   equ 0005h
I2C2CNTL_CNT5_SIZE                       equ 0001h
I2C2CNTL_CNT5_LENGTH                     equ 0001h
I2C2CNTL_CNT5_MASK                       equ 0020h
I2C2CNTL_CNT6_POSN                       equ 0006h
I2C2CNTL_CNT6_POSITION                   equ 0006h
I2C2CNTL_CNT6_SIZE                       equ 0001h
I2C2CNTL_CNT6_LENGTH                     equ 0001h
I2C2CNTL_CNT6_MASK                       equ 0040h
I2C2CNTL_CNT7_POSN                       equ 0007h
I2C2CNTL_CNT7_POSITION                   equ 0007h
I2C2CNTL_CNT7_SIZE                       equ 0001h
I2C2CNTL_CNT7_LENGTH                     equ 0001h
I2C2CNTL_CNT7_MASK                       equ 0080h
I2C2CNTL_I2C2CNT_POSN                    equ 0000h
I2C2CNTL_I2C2CNT_POSITION                equ 0000h
I2C2CNTL_I2C2CNT_SIZE                    equ 0008h
I2C2CNTL_I2C2CNT_LENGTH                  equ 0008h
I2C2CNTL_I2C2CNT_MASK                    equ 00FFh
I2C2CNTL_I2C2CNT0_POSN                   equ 0000h
I2C2CNTL_I2C2CNT0_POSITION               equ 0000h
I2C2CNTL_I2C2CNT0_SIZE                   equ 0001h
I2C2CNTL_I2C2CNT0_LENGTH                 equ 0001h
I2C2CNTL_I2C2CNT0_MASK                   equ 0001h
I2C2CNTL_I2C2CNT1_POSN                   equ 0001h
I2C2CNTL_I2C2CNT1_POSITION               equ 0001h
I2C2CNTL_I2C2CNT1_SIZE                   equ 0001h
I2C2CNTL_I2C2CNT1_LENGTH                 equ 0001h
I2C2CNTL_I2C2CNT1_MASK                   equ 0002h
I2C2CNTL_I2C2CNT2_POSN                   equ 0002h
I2C2CNTL_I2C2CNT2_POSITION               equ 0002h
I2C2CNTL_I2C2CNT2_SIZE                   equ 0001h
I2C2CNTL_I2C2CNT2_LENGTH                 equ 0001h
I2C2CNTL_I2C2CNT2_MASK                   equ 0004h
I2C2CNTL_I2C2CNT3_POSN                   equ 0003h
I2C2CNTL_I2C2CNT3_POSITION               equ 0003h
I2C2CNTL_I2C2CNT3_SIZE                   equ 0001h
I2C2CNTL_I2C2CNT3_LENGTH                 equ 0001h
I2C2CNTL_I2C2CNT3_MASK                   equ 0008h
I2C2CNTL_I2C2CNT4_POSN                   equ 0004h
I2C2CNTL_I2C2CNT4_POSITION               equ 0004h
I2C2CNTL_I2C2CNT4_SIZE                   equ 0001h
I2C2CNTL_I2C2CNT4_LENGTH                 equ 0001h
I2C2CNTL_I2C2CNT4_MASK                   equ 0010h
I2C2CNTL_I2C2CNT5_POSN                   equ 0005h
I2C2CNTL_I2C2CNT5_POSITION               equ 0005h
I2C2CNTL_I2C2CNT5_SIZE                   equ 0001h
I2C2CNTL_I2C2CNT5_LENGTH                 equ 0001h
I2C2CNTL_I2C2CNT5_MASK                   equ 0020h
I2C2CNTL_I2C2CNT6_POSN                   equ 0006h
I2C2CNTL_I2C2CNT6_POSITION               equ 0006h
I2C2CNTL_I2C2CNT6_SIZE                   equ 0001h
I2C2CNTL_I2C2CNT6_LENGTH                 equ 0001h
I2C2CNTL_I2C2CNT6_MASK                   equ 0040h
I2C2CNTL_I2C2CNT7_POSN                   equ 0007h
I2C2CNTL_I2C2CNT7_POSITION               equ 0007h
I2C2CNTL_I2C2CNT7_SIZE                   equ 0001h
I2C2CNTL_I2C2CNT7_LENGTH                 equ 0001h
I2C2CNTL_I2C2CNT7_MASK                   equ 0080h

// Register: I2C2CNTH
#define I2C2CNTH I2C2CNTH
I2C2CNTH                                 equ 02A2h
// bitfield definitions
I2C2CNTH_CNT_POSN                        equ 0000h
I2C2CNTH_CNT_POSITION                    equ 0000h
I2C2CNTH_CNT_SIZE                        equ 0008h
I2C2CNTH_CNT_LENGTH                      equ 0008h
I2C2CNTH_CNT_MASK                        equ 00FFh
I2C2CNTH_CNT8_POSN                       equ 0000h
I2C2CNTH_CNT8_POSITION                   equ 0000h
I2C2CNTH_CNT8_SIZE                       equ 0001h
I2C2CNTH_CNT8_LENGTH                     equ 0001h
I2C2CNTH_CNT8_MASK                       equ 0001h
I2C2CNTH_CNT9_POSN                       equ 0001h
I2C2CNTH_CNT9_POSITION                   equ 0001h
I2C2CNTH_CNT9_SIZE                       equ 0001h
I2C2CNTH_CNT9_LENGTH                     equ 0001h
I2C2CNTH_CNT9_MASK                       equ 0002h
I2C2CNTH_CNT10_POSN                      equ 0002h
I2C2CNTH_CNT10_POSITION                  equ 0002h
I2C2CNTH_CNT10_SIZE                      equ 0001h
I2C2CNTH_CNT10_LENGTH                    equ 0001h
I2C2CNTH_CNT10_MASK                      equ 0004h
I2C2CNTH_CNT11_POSN                      equ 0003h
I2C2CNTH_CNT11_POSITION                  equ 0003h
I2C2CNTH_CNT11_SIZE                      equ 0001h
I2C2CNTH_CNT11_LENGTH                    equ 0001h
I2C2CNTH_CNT11_MASK                      equ 0008h
I2C2CNTH_CNT12_POSN                      equ 0004h
I2C2CNTH_CNT12_POSITION                  equ 0004h
I2C2CNTH_CNT12_SIZE                      equ 0001h
I2C2CNTH_CNT12_LENGTH                    equ 0001h
I2C2CNTH_CNT12_MASK                      equ 0010h
I2C2CNTH_CNT13_POSN                      equ 0005h
I2C2CNTH_CNT13_POSITION                  equ 0005h
I2C2CNTH_CNT13_SIZE                      equ 0001h
I2C2CNTH_CNT13_LENGTH                    equ 0001h
I2C2CNTH_CNT13_MASK                      equ 0020h
I2C2CNTH_CNT14_POSN                      equ 0006h
I2C2CNTH_CNT14_POSITION                  equ 0006h
I2C2CNTH_CNT14_SIZE                      equ 0001h
I2C2CNTH_CNT14_LENGTH                    equ 0001h
I2C2CNTH_CNT14_MASK                      equ 0040h
I2C2CNTH_CNT15_POSN                      equ 0007h
I2C2CNTH_CNT15_POSITION                  equ 0007h
I2C2CNTH_CNT15_SIZE                      equ 0001h
I2C2CNTH_CNT15_LENGTH                    equ 0001h
I2C2CNTH_CNT15_MASK                      equ 0080h
I2C2CNTH_I2C2CNT_POSN                    equ 0000h
I2C2CNTH_I2C2CNT_POSITION                equ 0000h
I2C2CNTH_I2C2CNT_SIZE                    equ 0008h
I2C2CNTH_I2C2CNT_LENGTH                  equ 0008h
I2C2CNTH_I2C2CNT_MASK                    equ 00FFh
I2C2CNTH_I2C2CNT8_POSN                   equ 0000h
I2C2CNTH_I2C2CNT8_POSITION               equ 0000h
I2C2CNTH_I2C2CNT8_SIZE                   equ 0001h
I2C2CNTH_I2C2CNT8_LENGTH                 equ 0001h
I2C2CNTH_I2C2CNT8_MASK                   equ 0001h
I2C2CNTH_I2C2CNT9_POSN                   equ 0001h
I2C2CNTH_I2C2CNT9_POSITION               equ 0001h
I2C2CNTH_I2C2CNT9_SIZE                   equ 0001h
I2C2CNTH_I2C2CNT9_LENGTH                 equ 0001h
I2C2CNTH_I2C2CNT9_MASK                   equ 0002h
I2C2CNTH_I2C2CNT10_POSN                  equ 0002h
I2C2CNTH_I2C2CNT10_POSITION              equ 0002h
I2C2CNTH_I2C2CNT10_SIZE                  equ 0001h
I2C2CNTH_I2C2CNT10_LENGTH                equ 0001h
I2C2CNTH_I2C2CNT10_MASK                  equ 0004h
I2C2CNTH_I2C2CNT11_POSN                  equ 0003h
I2C2CNTH_I2C2CNT11_POSITION              equ 0003h
I2C2CNTH_I2C2CNT11_SIZE                  equ 0001h
I2C2CNTH_I2C2CNT11_LENGTH                equ 0001h
I2C2CNTH_I2C2CNT11_MASK                  equ 0008h
I2C2CNTH_I2C2CNT12_POSN                  equ 0004h
I2C2CNTH_I2C2CNT12_POSITION              equ 0004h
I2C2CNTH_I2C2CNT12_SIZE                  equ 0001h
I2C2CNTH_I2C2CNT12_LENGTH                equ 0001h
I2C2CNTH_I2C2CNT12_MASK                  equ 0010h
I2C2CNTH_I2C2CNT13_POSN                  equ 0005h
I2C2CNTH_I2C2CNT13_POSITION              equ 0005h
I2C2CNTH_I2C2CNT13_SIZE                  equ 0001h
I2C2CNTH_I2C2CNT13_LENGTH                equ 0001h
I2C2CNTH_I2C2CNT13_MASK                  equ 0020h
I2C2CNTH_I2C2CNT14_POSN                  equ 0006h
I2C2CNTH_I2C2CNT14_POSITION              equ 0006h
I2C2CNTH_I2C2CNT14_SIZE                  equ 0001h
I2C2CNTH_I2C2CNT14_LENGTH                equ 0001h
I2C2CNTH_I2C2CNT14_MASK                  equ 0040h
I2C2CNTH_I2C2CNT15_POSN                  equ 0007h
I2C2CNTH_I2C2CNT15_POSITION              equ 0007h
I2C2CNTH_I2C2CNT15_SIZE                  equ 0001h
I2C2CNTH_I2C2CNT15_LENGTH                equ 0001h
I2C2CNTH_I2C2CNT15_MASK                  equ 0080h

// Register: I2C2ADB0
#define I2C2ADB0 I2C2ADB0
I2C2ADB0                                 equ 02A3h
// bitfield definitions
I2C2ADB0_ADB_POSN                        equ 0000h
I2C2ADB0_ADB_POSITION                    equ 0000h
I2C2ADB0_ADB_SIZE                        equ 0008h
I2C2ADB0_ADB_LENGTH                      equ 0008h
I2C2ADB0_ADB_MASK                        equ 00FFh

