garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.inc
// Register: I2C2STAT0
#define I2C2STAT0 I2C2STAT0
I2C2STAT0                                equ 02AEh
// bitfield definitions
I2C2STAT0_D_POSN                         equ 0003h
I2C2STAT0_D_POSITION                     equ 0003h
I2C2STAT0_D_SIZE                         equ 0001h
I2C2STAT0_D_LENGTH                       equ 0001h
I2C2STAT0_D_MASK                         equ 0008h
I2C2STAT0_R_POSN                         equ 0004h
I2C2STAT0_R_POSITION                     equ 0004h
I2C2STAT0_R_SIZE                         equ 0001h
I2C2STAT0_R_LENGTH                       equ 0001h
I2C2STAT0_R_MASK                         equ 0010h
I2C2STAT0_MMA_POSN                       equ 0005h
I2C2STAT0_MMA_POSITION                   equ 0005h
I2C2STAT0_MMA_SIZE                       equ 0001h
I2C2STAT0_MMA_LENGTH                     equ 0001h
I2C2STAT0_MMA_MASK                       equ 0020h
I2C2STAT0_SMA_POSN                       equ 0006h
I2C2STAT0_SMA_POSITION                   equ 0006h
I2C2STAT0_SMA_SIZE                       equ 0001h
I2C2STAT0_SMA_LENGTH                     equ 0001h
I2C2STAT0_SMA_MASK                       equ 0040h
I2C2STAT0_BFRE_POSN                      equ 0007h
I2C2STAT0_BFRE_POSITION                  equ 0007h
I2C2STAT0_BFRE_SIZE                      equ 0001h
I2C2STAT0_BFRE_LENGTH                    equ 0001h
I2C2STAT0_BFRE_MASK                      equ 0080h
I2C2STAT0_DATA_POSN                      equ 0003h
I2C2STAT0_DATA_POSITION                  equ 0003h
I2C2STAT0_DATA_SIZE                      equ 0001h
I2C2STAT0_DATA_LENGTH                    equ 0001h
I2C2STAT0_DATA_MASK                      equ 0008h
I2C2STAT0_READ_POSN                      equ 0004h
I2C2STAT0_READ_POSITION                  equ 0004h
I2C2STAT0_READ_SIZE                      equ 0001h
I2C2STAT0_READ_LENGTH                    equ 0001h
I2C2STAT0_READ_MASK                      equ 0010h
I2C2STAT0_NOT_ADDRESS_POSN               equ 0003h
I2C2STAT0_NOT_ADDRESS_POSITION           equ 0003h
I2C2STAT0_NOT_ADDRESS_SIZE               equ 0001h
I2C2STAT0_NOT_ADDRESS_LENGTH             equ 0001h
I2C2STAT0_NOT_ADDRESS_MASK               equ 0008h
I2C2STAT0_NOT_WRITE_POSN                 equ 0004h
I2C2STAT0_NOT_WRITE_POSITION             equ 0004h
I2C2STAT0_NOT_WRITE_SIZE                 equ 0001h
I2C2STAT0_NOT_WRITE_LENGTH               equ 0001h
I2C2STAT0_NOT_WRITE_MASK                 equ 0010h
I2C2STAT0_NOT_A_POSN                     equ 0003h
I2C2STAT0_NOT_A_POSITION                 equ 0003h
I2C2STAT0_NOT_A_SIZE                     equ 0001h
I2C2STAT0_NOT_A_LENGTH                   equ 0001h
I2C2STAT0_NOT_A_MASK                     equ 0008h
I2C2STAT0_NOT_W_POSN                     equ 0004h
I2C2STAT0_NOT_W_POSITION                 equ 0004h
I2C2STAT0_NOT_W_SIZE                     equ 0001h
I2C2STAT0_NOT_W_LENGTH                   equ 0001h
I2C2STAT0_NOT_W_MASK                     equ 0010h

// Register: I2C2STAT1
#define I2C2STAT1 I2C2STAT1
I2C2STAT1                                equ 02AFh
// bitfield definitions
I2C2STAT1_RXBF_POSN                      equ 0000h
I2C2STAT1_RXBF_POSITION                  equ 0000h
I2C2STAT1_RXBF_SIZE                      equ 0001h
I2C2STAT1_RXBF_LENGTH                    equ 0001h
I2C2STAT1_RXBF_MASK                      equ 0001h
I2C2STAT1_CLRBF_POSN                     equ 0002h
I2C2STAT1_CLRBF_POSITION                 equ 0002h
I2C2STAT1_CLRBF_SIZE                     equ 0001h
I2C2STAT1_CLRBF_LENGTH                   equ 0001h
I2C2STAT1_CLRBF_MASK                     equ 0004h
I2C2STAT1_RXRE_POSN                      equ 0003h
I2C2STAT1_RXRE_POSITION                  equ 0003h
I2C2STAT1_RXRE_SIZE                      equ 0001h
I2C2STAT1_RXRE_LENGTH                    equ 0001h
I2C2STAT1_RXRE_MASK                      equ 0008h
I2C2STAT1_TXBE_POSN                      equ 0005h
I2C2STAT1_TXBE_POSITION                  equ 0005h
I2C2STAT1_TXBE_SIZE                      equ 0001h
I2C2STAT1_TXBE_LENGTH                    equ 0001h
I2C2STAT1_TXBE_MASK                      equ 0020h
I2C2STAT1_TXWE_POSN                      equ 0007h
I2C2STAT1_TXWE_POSITION                  equ 0007h
I2C2STAT1_TXWE_SIZE                      equ 0001h
I2C2STAT1_TXWE_LENGTH                    equ 0001h
I2C2STAT1_TXWE_MASK                      equ 0080h

// Register: I2C2PIR
#define I2C2PIR I2C2PIR
I2C2PIR                                  equ 02B0h
// bitfield definitions
I2C2PIR_SCIF_POSN                        equ 0000h
I2C2PIR_SCIF_POSITION                    equ 0000h
I2C2PIR_SCIF_SIZE                        equ 0001h
I2C2PIR_SCIF_LENGTH                      equ 0001h
I2C2PIR_SCIF_MASK                        equ 0001h
I2C2PIR_RSCIF_POSN                       equ 0001h
I2C2PIR_RSCIF_POSITION                   equ 0001h
I2C2PIR_RSCIF_SIZE                       equ 0001h
I2C2PIR_RSCIF_LENGTH                     equ 0001h
I2C2PIR_RSCIF_MASK                       equ 0002h
I2C2PIR_PCIF_POSN                        equ 0002h
I2C2PIR_PCIF_POSITION                    equ 0002h
I2C2PIR_PCIF_SIZE                        equ 0001h
I2C2PIR_PCIF_LENGTH                      equ 0001h
I2C2PIR_PCIF_MASK                        equ 0004h
I2C2PIR_ADRIF_POSN                       equ 0003h
I2C2PIR_ADRIF_POSITION                   equ 0003h
I2C2PIR_ADRIF_SIZE                       equ 0001h
I2C2PIR_ADRIF_LENGTH                     equ 0001h
I2C2PIR_ADRIF_MASK                       equ 0008h
I2C2PIR_WRIF_POSN                        equ 0004h
I2C2PIR_WRIF_POSITION                    equ 0004h
I2C2PIR_WRIF_SIZE                        equ 0001h
I2C2PIR_WRIF_LENGTH                      equ 0001h
I2C2PIR_WRIF_MASK                        equ 0010h
I2C2PIR_ACKTIF_POSN                      equ 0006h
I2C2PIR_ACKTIF_POSITION                  equ 0006h
I2C2PIR_ACKTIF_SIZE                      equ 0001h
I2C2PIR_ACKTIF_LENGTH                    equ 0001h
I2C2PIR_ACKTIF_MASK                      equ 0040h
I2C2PIR_CNTIF_POSN                       equ 0007h
I2C2PIR_CNTIF_POSITION                   equ 0007h
I2C2PIR_CNTIF_SIZE                       equ 0001h
I2C2PIR_CNTIF_LENGTH                     equ 0001h
I2C2PIR_CNTIF_MASK                       equ 0080h
I2C2PIR_SC2IF_POSN                       equ 0000h
I2C2PIR_SC2IF_POSITION                   equ 0000h
I2C2PIR_SC2IF_SIZE                       equ 0001h
I2C2PIR_SC2IF_LENGTH                     equ 0001h
I2C2PIR_SC2IF_MASK                       equ 0001h
I2C2PIR_RSC2IF_POSN                      equ 0001h
I2C2PIR_RSC2IF_POSITION                  equ 0001h
I2C2PIR_RSC2IF_SIZE                      equ 0001h
I2C2PIR_RSC2IF_LENGTH                    equ 0001h
I2C2PIR_RSC2IF_MASK                      equ 0002h
I2C2PIR_PC2IF_POSN                       equ 0002h
I2C2PIR_PC2IF_POSITION                   equ 0002h
I2C2PIR_PC2IF_SIZE                       equ 0001h
I2C2PIR_PC2IF_LENGTH                     equ 0001h
I2C2PIR_PC2IF_MASK                       equ 0004h
I2C2PIR_ADR2IF_POSN                      equ 0003h
I2C2PIR_ADR2IF_POSITION                  equ 0003h
I2C2PIR_ADR2IF_SIZE                      equ 0001h
I2C2PIR_ADR2IF_LENGTH                    equ 0001h
I2C2PIR_ADR2IF_MASK                      equ 0008h
I2C2PIR_WR2IF_POSN                       equ 0004h
I2C2PIR_WR2IF_POSITION                   equ 0004h
I2C2PIR_WR2IF_SIZE                       equ 0001h
I2C2PIR_WR2IF_LENGTH                     equ 0001h
I2C2PIR_WR2IF_MASK                       equ 0010h
I2C2PIR_ACKT2IF_POSN                     equ 0006h
I2C2PIR_ACKT2IF_POSITION                 equ 0006h
I2C2PIR_ACKT2IF_SIZE                     equ 0001h
I2C2PIR_ACKT2IF_LENGTH                   equ 0001h
I2C2PIR_ACKT2IF_MASK                     equ 0040h
I2C2PIR_CNT2IF_POSN                      equ 0007h
I2C2PIR_CNT2IF_POSITION                  equ 0007h
I2C2PIR_CNT2IF_SIZE                      equ 0001h
I2C2PIR_CNT2IF_LENGTH                    equ 0001h
I2C2PIR_CNT2IF_MASK                      equ 0080h

// Register: I2C2PIE
#define I2C2PIE I2C2PIE
I2C2PIE                                  equ 02B1h
// bitfield definitions
I2C2PIE_SCIE_POSN                        equ 0000h
I2C2PIE_SCIE_POSITION                    equ 0000h
I2C2PIE_SCIE_SIZE                        equ 0001h
I2C2PIE_SCIE_LENGTH                      equ 0001h
I2C2PIE_SCIE_MASK                        equ 0001h
I2C2PIE_RSCIE_POSN                       equ 0001h
I2C2PIE_RSCIE_POSITION                   equ 0001h
I2C2PIE_RSCIE_SIZE                       equ 0001h
I2C2PIE_RSCIE_LENGTH                     equ 0001h
I2C2PIE_RSCIE_MASK                       equ 0002h
I2C2PIE_PCIE_POSN                        equ 0002h
I2C2PIE_PCIE_POSITION                    equ 0002h
I2C2PIE_PCIE_SIZE                        equ 0001h
I2C2PIE_PCIE_LENGTH                      equ 0001h
I2C2PIE_PCIE_MASK                        equ 0004h
I2C2PIE_ADRIE_POSN                       equ 0003h
I2C2PIE_ADRIE_POSITION                   equ 0003h
I2C2PIE_ADRIE_SIZE                       equ 0001h
I2C2PIE_ADRIE_LENGTH                     equ 0001h
I2C2PIE_ADRIE_MASK                       equ 0008h
I2C2PIE_WRIE_POSN                        equ 0004h
I2C2PIE_WRIE_POSITION                    equ 0004h
I2C2PIE_WRIE_SIZE                        equ 0001h
I2C2PIE_WRIE_LENGTH                      equ 0001h
I2C2PIE_WRIE_MASK                        equ 0010h
I2C2PIE_ACKTIE_POSN                      equ 0006h
I2C2PIE_ACKTIE_POSITION                  equ 0006h
I2C2PIE_ACKTIE_SIZE                      equ 0001h
I2C2PIE_ACKTIE_LENGTH                    equ 0001h
I2C2PIE_ACKTIE_MASK                      equ 0040h
I2C2PIE_CNTIE_POSN                       equ 0007h
I2C2PIE_CNTIE_POSITION                   equ 0007h
I2C2PIE_CNTIE_SIZE                       equ 0001h
I2C2PIE_CNTIE_LENGTH                     equ 0001h
I2C2PIE_CNTIE_MASK                       equ 0080h
I2C2PIE_SC2IE_POSN                       equ 0000h
I2C2PIE_SC2IE_POSITION                   equ 0000h
I2C2PIE_SC2IE_SIZE                       equ 0001h
I2C2PIE_SC2IE_LENGTH                     equ 0001h
I2C2PIE_SC2IE_MASK                       equ 0001h
I2C2PIE_RSC2IE_POSN                      equ 0001h
I2C2PIE_RSC2IE_POSITION                  equ 0001h
I2C2PIE_RSC2IE_SIZE                      equ 0001h
I2C2PIE_RSC2IE_LENGTH                    equ 0001h
I2C2PIE_RSC2IE_MASK                      equ 0002h
I2C2PIE_PC2IE_POSN                       equ 0002h
I2C2PIE_PC2IE_POSITION                   equ 0002h
I2C2PIE_PC2IE_SIZE                       equ 0001h
I2C2PIE_PC2IE_LENGTH                     equ 0001h
I2C2PIE_PC2IE_MASK                       equ 0004h
I2C2PIE_ADR2IE_POSN                      equ 0003h
I2C2PIE_ADR2IE_POSITION                  equ 0003h
I2C2PIE_ADR2IE_SIZE                      equ 0001h
I2C2PIE_ADR2IE_LENGTH                    equ 0001h
I2C2PIE_ADR2IE_MASK                      equ 0008h
I2C2PIE_WR2IE_POSN                       equ 0004h
I2C2PIE_WR2IE_POSITION                   equ 0004h
I2C2PIE_WR2IE_SIZE                       equ 0001h
I2C2PIE_WR2IE_LENGTH                     equ 0001h
I2C2PIE_WR2IE_MASK                       equ 0010h
I2C2PIE_ACKT2IE_POSN                     equ 0006h
I2C2PIE_ACKT2IE_POSITION                 equ 0006h
I2C2PIE_ACKT2IE_SIZE                     equ 0001h
I2C2PIE_ACKT2IE_LENGTH                   equ 0001h
I2C2PIE_ACKT2IE_MASK                     equ 0040h
I2C2PIE_CNT2IE_POSN                      equ 0007h
I2C2PIE_CNT2IE_POSITION                  equ 0007h
I2C2PIE_CNT2IE_SIZE                      equ 0001h
I2C2PIE_CNT2IE_LENGTH                    equ 0001h
I2C2PIE_CNT2IE_MASK                      equ 0080h

// Register: I2C2BTO
#define I2C2BTO I2C2BTO
I2C2BTO                                  equ 02B2h
// bitfield definitions
I2C2BTO_TOTIME_POSN                      equ 0000h
I2C2BTO_TOTIME_POSITION                  equ 0000h
I2C2BTO_TOTIME_SIZE                      equ 0006h
I2C2BTO_TOTIME_LENGTH                    equ 0006h
I2C2BTO_TOTIME_MASK                      equ 003Fh
I2C2BTO_TOBY32_POSN                      equ 0006h
I2C2BTO_TOBY32_POSITION                  equ 0006h
I2C2BTO_TOBY32_SIZE                      equ 0001h
I2C2BTO_TOBY32_LENGTH                    equ 0001h
I2C2BTO_TOBY32_MASK                      equ 0040h
I2C2BTO_TOREC_POSN                       equ 0007h
I2C2BTO_TOREC_POSITION                   equ 0007h
I2C2BTO_TOREC_SIZE                       equ 0001h
I2C2BTO_TOREC_LENGTH                     equ 0001h
I2C2BTO_TOREC_MASK                       equ 0080h
I2C2BTO_TOTIME0_POSN                     equ 0000h
I2C2BTO_TOTIME0_POSITION                 equ 0000h
I2C2BTO_TOTIME0_SIZE                     equ 0001h
I2C2BTO_TOTIME0_LENGTH                   equ 0001h
I2C2BTO_TOTIME0_MASK                     equ 0001h
I2C2BTO_TOTIME1_POSN                     equ 0001h
I2C2BTO_TOTIME1_POSITION                 equ 0001h
I2C2BTO_TOTIME1_SIZE                     equ 0001h
I2C2BTO_TOTIME1_LENGTH                   equ 0001h
I2C2BTO_TOTIME1_MASK                     equ 0002h
I2C2BTO_TOTIME2_POSN                     equ 0002h
I2C2BTO_TOTIME2_POSITION                 equ 0002h
I2C2BTO_TOTIME2_SIZE                     equ 0001h
I2C2BTO_TOTIME2_LENGTH                   equ 0001h
I2C2BTO_TOTIME2_MASK                     equ 0004h
I2C2BTO_TOTIME3_POSN                     equ 0003h
I2C2BTO_TOTIME3_POSITION                 equ 0003h
I2C2BTO_TOTIME3_SIZE                     equ 0001h
I2C2BTO_TOTIME3_LENGTH                   equ 0001h
I2C2BTO_TOTIME3_MASK                     equ 0008h
I2C2BTO_TOTIME4_POSN                     equ 0004h
I2C2BTO_TOTIME4_POSITION                 equ 0004h
I2C2BTO_TOTIME4_SIZE                     equ 0001h
I2C2BTO_TOTIME4_LENGTH                   equ 0001h
I2C2BTO_TOTIME4_MASK                     equ 0010h
I2C2BTO_TOTIME5_POSN                     equ 0005h
I2C2BTO_TOTIME5_POSITION                 equ 0005h
I2C2BTO_TOTIME5_SIZE                     equ 0001h
I2C2BTO_TOTIME5_LENGTH                   equ 0001h
I2C2BTO_TOTIME5_MASK                     equ 0020h

