garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.inc
// Register: PWM2S1P2
#define PWM2S1P2 PWM2S1P2
PWM2S1P2                                 equ 047Ch

// Register: PWM2S1P2L
#define PWM2S1P2L PWM2S1P2L
PWM2S1P2L                                equ 047Ch
// bitfield definitions
PWM2S1P2L_S1P2L_POSN                     equ 0000h
PWM2S1P2L_S1P2L_POSITION                 equ 0000h
PWM2S1P2L_S1P2L_SIZE                     equ 0008h
PWM2S1P2L_S1P2L_LENGTH                   equ 0008h
PWM2S1P2L_S1P2L_MASK                     equ 00FFh

// Register: PWM2S1P2H
#define PWM2S1P2H PWM2S1P2H
PWM2S1P2H                                equ 047Dh
// bitfield definitions
PWM2S1P2H_S1P2H_POSN                     equ 0000h
PWM2S1P2H_S1P2H_POSITION                 equ 0000h
PWM2S1P2H_S1P2H_SIZE                     equ 0008h
PWM2S1P2H_S1P2H_LENGTH                   equ 0008h
PWM2S1P2H_S1P2H_MASK                     equ 00FFh

// Register: PWM3ERS
#define PWM3ERS PWM3ERS
PWM3ERS                                  equ 047Eh
// bitfield definitions
PWM3ERS_ERS_POSN                         equ 0000h
PWM3ERS_ERS_POSITION                     equ 0000h
PWM3ERS_ERS_SIZE                         equ 0008h
PWM3ERS_ERS_LENGTH                       equ 0008h
PWM3ERS_ERS_MASK                         equ 00FFh
PWM3ERS_ERS0_POSN                        equ 0000h
PWM3ERS_ERS0_POSITION                    equ 0000h
PWM3ERS_ERS0_SIZE                        equ 0001h
PWM3ERS_ERS0_LENGTH                      equ 0001h
PWM3ERS_ERS0_MASK                        equ 0001h
PWM3ERS_ERS1_POSN                        equ 0001h
PWM3ERS_ERS1_POSITION                    equ 0001h
PWM3ERS_ERS1_SIZE                        equ 0001h
PWM3ERS_ERS1_LENGTH                      equ 0001h
PWM3ERS_ERS1_MASK                        equ 0002h
PWM3ERS_ERS2_POSN                        equ 0002h
PWM3ERS_ERS2_POSITION                    equ 0002h
PWM3ERS_ERS2_SIZE                        equ 0001h
PWM3ERS_ERS2_LENGTH                      equ 0001h
PWM3ERS_ERS2_MASK                        equ 0004h
PWM3ERS_ERS3_POSN                        equ 0003h
PWM3ERS_ERS3_POSITION                    equ 0003h
PWM3ERS_ERS3_SIZE                        equ 0001h
PWM3ERS_ERS3_LENGTH                      equ 0001h
PWM3ERS_ERS3_MASK                        equ 0008h

// Register: PWM3CLK
#define PWM3CLK PWM3CLK
PWM3CLK                                  equ 047Fh
// bitfield definitions
PWM3CLK_CLK_POSN                         equ 0000h
PWM3CLK_CLK_POSITION                     equ 0000h
PWM3CLK_CLK_SIZE                         equ 0008h
PWM3CLK_CLK_LENGTH                       equ 0008h
PWM3CLK_CLK_MASK                         equ 00FFh
PWM3CLK_CLK0_POSN                        equ 0000h
PWM3CLK_CLK0_POSITION                    equ 0000h
PWM3CLK_CLK0_SIZE                        equ 0001h
PWM3CLK_CLK0_LENGTH                      equ 0001h
PWM3CLK_CLK0_MASK                        equ 0001h
PWM3CLK_CLK1_POSN                        equ 0001h
PWM3CLK_CLK1_POSITION                    equ 0001h
PWM3CLK_CLK1_SIZE                        equ 0001h
PWM3CLK_CLK1_LENGTH                      equ 0001h
PWM3CLK_CLK1_MASK                        equ 0002h
PWM3CLK_CLK2_POSN                        equ 0002h
PWM3CLK_CLK2_POSITION                    equ 0002h
PWM3CLK_CLK2_SIZE                        equ 0001h
PWM3CLK_CLK2_LENGTH                      equ 0001h
PWM3CLK_CLK2_MASK                        equ 0004h
PWM3CLK_CLK3_POSN                        equ 0003h
PWM3CLK_CLK3_POSITION                    equ 0003h
PWM3CLK_CLK3_SIZE                        equ 0001h
PWM3CLK_CLK3_LENGTH                      equ 0001h
PWM3CLK_CLK3_MASK                        equ 0008h
PWM3CLK_CLK4_POSN                        equ 0004h
PWM3CLK_CLK4_POSITION                    equ 0004h
PWM3CLK_CLK4_SIZE                        equ 0001h
PWM3CLK_CLK4_LENGTH                      equ 0001h
PWM3CLK_CLK4_MASK                        equ 0010h

// Register: PWM3LDS
#define PWM3LDS PWM3LDS
PWM3LDS                                  equ 0480h
// bitfield definitions
PWM3LDS_LDS_POSN                         equ 0000h
PWM3LDS_LDS_POSITION                     equ 0000h
PWM3LDS_LDS_SIZE                         equ 0008h
PWM3LDS_LDS_LENGTH                       equ 0008h
PWM3LDS_LDS_MASK                         equ 00FFh
PWM3LDS_LDS0_POSN                        equ 0000h
PWM3LDS_LDS0_POSITION                    equ 0000h
PWM3LDS_LDS0_SIZE                        equ 0001h
PWM3LDS_LDS0_LENGTH                      equ 0001h
PWM3LDS_LDS0_MASK                        equ 0001h
PWM3LDS_LDS1_POSN                        equ 0001h
PWM3LDS_LDS1_POSITION                    equ 0001h
PWM3LDS_LDS1_SIZE                        equ 0001h
PWM3LDS_LDS1_LENGTH                      equ 0001h
PWM3LDS_LDS1_MASK                        equ 0002h
PWM3LDS_LDS2_POSN                        equ 0002h
PWM3LDS_LDS2_POSITION                    equ 0002h
PWM3LDS_LDS2_SIZE                        equ 0001h
PWM3LDS_LDS2_LENGTH                      equ 0001h
PWM3LDS_LDS2_MASK                        equ 0004h
PWM3LDS_LDS3_POSN                        equ 0003h
PWM3LDS_LDS3_POSITION                    equ 0003h
PWM3LDS_LDS3_SIZE                        equ 0001h
PWM3LDS_LDS3_LENGTH                      equ 0001h
PWM3LDS_LDS3_MASK                        equ 0008h

// Register: PWM3PR
#define PWM3PR PWM3PR
PWM3PR                                   equ 0481h

// Register: PWM3PRL
#define PWM3PRL PWM3PRL
PWM3PRL                                  equ 0481h
// bitfield definitions
PWM3PRL_PRL_POSN                         equ 0000h
PWM3PRL_PRL_POSITION                     equ 0000h
PWM3PRL_PRL_SIZE                         equ 0008h
PWM3PRL_PRL_LENGTH                       equ 0008h
PWM3PRL_PRL_MASK                         equ 00FFh

// Register: PWM3PRH
#define PWM3PRH PWM3PRH
PWM3PRH                                  equ 0482h
// bitfield definitions
PWM3PRH_PRH_POSN                         equ 0000h
PWM3PRH_PRH_POSITION                     equ 0000h
PWM3PRH_PRH_SIZE                         equ 0008h
PWM3PRH_PRH_LENGTH                       equ 0008h
PWM3PRH_PRH_MASK                         equ 00FFh

// Register: PWM3CPRE
#define PWM3CPRE PWM3CPRE
PWM3CPRE                                 equ 0483h
// bitfield definitions
PWM3CPRE_CPRE_POSN                       equ 0000h
PWM3CPRE_CPRE_POSITION                   equ 0000h
PWM3CPRE_CPRE_SIZE                       equ 0008h
PWM3CPRE_CPRE_LENGTH                     equ 0008h
PWM3CPRE_CPRE_MASK                       equ 00FFh

