garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 04AEh
// bitfield definitions
PIE4_U1RXIE_POSN                         equ 0000h
PIE4_U1RXIE_POSITION                     equ 0000h
PIE4_U1RXIE_SIZE                         equ 0001h
PIE4_U1RXIE_LENGTH                       equ 0001h
PIE4_U1RXIE_MASK                         equ 0001h
PIE4_U1TXIE_POSN                         equ 0001h
PIE4_U1TXIE_POSITION                     equ 0001h
PIE4_U1TXIE_SIZE                         equ 0001h
PIE4_U1TXIE_LENGTH                       equ 0001h
PIE4_U1TXIE_MASK                         equ 0002h
PIE4_U1EIE_POSN                          equ 0002h
PIE4_U1EIE_POSITION                      equ 0002h
PIE4_U1EIE_SIZE                          equ 0001h
PIE4_U1EIE_LENGTH                        equ 0001h
PIE4_U1EIE_MASK                          equ 0004h
PIE4_U1IE_POSN                           equ 0003h
PIE4_U1IE_POSITION                       equ 0003h
PIE4_U1IE_SIZE                           equ 0001h
PIE4_U1IE_LENGTH                         equ 0001h
PIE4_U1IE_MASK                           equ 0008h
PIE4_TMR3IE_POSN                         equ 0004h
PIE4_TMR3IE_POSITION                     equ 0004h
PIE4_TMR3IE_SIZE                         equ 0001h
PIE4_TMR3IE_LENGTH                       equ 0001h
PIE4_TMR3IE_MASK                         equ 0010h
PIE4_TMR3GIE_POSN                        equ 0005h
PIE4_TMR3GIE_POSITION                    equ 0005h
PIE4_TMR3GIE_SIZE                        equ 0001h
PIE4_TMR3GIE_LENGTH                      equ 0001h
PIE4_TMR3GIE_MASK                        equ 0020h
PIE4_PWM1PIE_POSN                        equ 0006h
PIE4_PWM1PIE_POSITION                    equ 0006h
PIE4_PWM1PIE_SIZE                        equ 0001h
PIE4_PWM1PIE_LENGTH                      equ 0001h
PIE4_PWM1PIE_MASK                        equ 0040h
PIE4_PWM1IE_POSN                         equ 0007h
PIE4_PWM1IE_POSITION                     equ 0007h
PIE4_PWM1IE_SIZE                         equ 0001h
PIE4_PWM1IE_LENGTH                       equ 0001h
PIE4_PWM1IE_MASK                         equ 0080h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 04AFh
// bitfield definitions
PIE5_CLC6IE_POSN                         equ 0001h
PIE5_CLC6IE_POSITION                     equ 0001h
PIE5_CLC6IE_SIZE                         equ 0001h
PIE5_CLC6IE_LENGTH                       equ 0001h
PIE5_CLC6IE_MASK                         equ 0002h
PIE5_TU16AIE_POSN                        equ 0002h
PIE5_TU16AIE_POSITION                    equ 0002h
PIE5_TU16AIE_SIZE                        equ 0001h
PIE5_TU16AIE_LENGTH                      equ 0001h
PIE5_TU16AIE_MASK                        equ 0004h
PIE5_TMR6IE_POSN                         equ 0003h
PIE5_TMR6IE_POSITION                     equ 0003h
PIE5_TMR6IE_SIZE                         equ 0001h
PIE5_TMR6IE_LENGTH                       equ 0001h
PIE5_TMR6IE_MASK                         equ 0008h
PIE5_C2IE_POSN                           equ 0004h
PIE5_C2IE_POSITION                       equ 0004h
PIE5_C2IE_SIZE                           equ 0001h
PIE5_C2IE_LENGTH                         equ 0001h
PIE5_C2IE_MASK                           equ 0010h
PIE5_CLC2IE_POSN                         equ 0005h
PIE5_CLC2IE_POSITION                     equ 0005h
PIE5_CLC2IE_SIZE                         equ 0001h
PIE5_CLC2IE_LENGTH                       equ 0001h
PIE5_CLC2IE_MASK                         equ 0020h
PIE5_PWM2PIE_POSN                        equ 0006h
PIE5_PWM2PIE_POSITION                    equ 0006h
PIE5_PWM2PIE_SIZE                        equ 0001h
PIE5_PWM2PIE_LENGTH                      equ 0001h
PIE5_PWM2PIE_MASK                        equ 0040h
PIE5_PWM2IE_POSN                         equ 0007h
PIE5_PWM2IE_POSITION                     equ 0007h
PIE5_PWM2IE_SIZE                         equ 0001h
PIE5_PWM2IE_LENGTH                       equ 0001h
PIE5_PWM2IE_MASK                         equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 04B0h
// bitfield definitions
PIE6_INT1IE_POSN                         equ 0000h
PIE6_INT1IE_POSITION                     equ 0000h
PIE6_INT1IE_SIZE                         equ 0001h
PIE6_INT1IE_LENGTH                       equ 0001h
PIE6_INT1IE_MASK                         equ 0001h
PIE6_CLC7IE_POSN                         equ 0001h
PIE6_CLC7IE_POSITION                     equ 0001h
PIE6_CLC7IE_SIZE                         equ 0001h
PIE6_CLC7IE_LENGTH                       equ 0001h
PIE6_CLC7IE_MASK                         equ 0002h
PIE6_CWG1IE_POSN                         equ 0002h
PIE6_CWG1IE_POSITION                     equ 0002h
PIE6_CWG1IE_SIZE                         equ 0001h
PIE6_CWG1IE_LENGTH                       equ 0001h
PIE6_CWG1IE_MASK                         equ 0004h
PIE6_NCO1IE_POSN                         equ 0003h
PIE6_NCO1IE_POSITION                     equ 0003h
PIE6_NCO1IE_SIZE                         equ 0001h
PIE6_NCO1IE_LENGTH                       equ 0001h
PIE6_NCO1IE_MASK                         equ 0008h
PIE6_DMA2SCNTIE_POSN                     equ 0004h
PIE6_DMA2SCNTIE_POSITION                 equ 0004h
PIE6_DMA2SCNTIE_SIZE                     equ 0001h
PIE6_DMA2SCNTIE_LENGTH                   equ 0001h
PIE6_DMA2SCNTIE_MASK                     equ 0010h
PIE6_DMA2DCNTIE_POSN                     equ 0005h
PIE6_DMA2DCNTIE_POSITION                 equ 0005h
PIE6_DMA2DCNTIE_SIZE                     equ 0001h
PIE6_DMA2DCNTIE_LENGTH                   equ 0001h
PIE6_DMA2DCNTIE_MASK                     equ 0020h
PIE6_DMA2ORIE_POSN                       equ 0006h
PIE6_DMA2ORIE_POSITION                   equ 0006h
PIE6_DMA2ORIE_SIZE                       equ 0001h
PIE6_DMA2ORIE_LENGTH                     equ 0001h
PIE6_DMA2ORIE_MASK                       equ 0040h
PIE6_DMA2AIE_POSN                        equ 0007h
PIE6_DMA2AIE_POSITION                    equ 0007h
PIE6_DMA2AIE_SIZE                        equ 0001h
PIE6_DMA2AIE_LENGTH                      equ 0001h
PIE6_DMA2AIE_MASK                        equ 0080h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 04B1h
// bitfield definitions
PIE7_I2C1RXIE_POSN                       equ 0000h
PIE7_I2C1RXIE_POSITION                   equ 0000h
PIE7_I2C1RXIE_SIZE                       equ 0001h
PIE7_I2C1RXIE_LENGTH                     equ 0001h
PIE7_I2C1RXIE_MASK                       equ 0001h
PIE7_I2C1TXIE_POSN                       equ 0001h
PIE7_I2C1TXIE_POSITION                   equ 0001h
PIE7_I2C1TXIE_SIZE                       equ 0001h
PIE7_I2C1TXIE_LENGTH                     equ 0001h
PIE7_I2C1TXIE_MASK                       equ 0002h
PIE7_I2C1IE_POSN                         equ 0002h
PIE7_I2C1IE_POSITION                     equ 0002h
PIE7_I2C1IE_SIZE                         equ 0001h
PIE7_I2C1IE_LENGTH                       equ 0001h
PIE7_I2C1IE_MASK                         equ 0004h
PIE7_I2C1EIE_POSN                        equ 0003h
PIE7_I2C1EIE_POSITION                    equ 0003h
PIE7_I2C1EIE_SIZE                        equ 0001h
PIE7_I2C1EIE_LENGTH                      equ 0001h
PIE7_I2C1EIE_MASK                        equ 0008h
PIE7_CLC3IE_POSN                         equ 0005h
PIE7_CLC3IE_POSITION                     equ 0005h
PIE7_CLC3IE_SIZE                         equ 0001h
PIE7_CLC3IE_LENGTH                       equ 0001h
PIE7_CLC3IE_MASK                         equ 0020h
PIE7_PWM3PIE_POSN                        equ 0006h
PIE7_PWM3PIE_POSITION                    equ 0006h
PIE7_PWM3PIE_SIZE                        equ 0001h
PIE7_PWM3PIE_LENGTH                      equ 0001h
PIE7_PWM3PIE_MASK                        equ 0040h
PIE7_PWM3IE_POSN                         equ 0007h
PIE7_PWM3IE_POSITION                     equ 0007h
PIE7_PWM3IE_SIZE                         equ 0001h
PIE7_PWM3IE_LENGTH                       equ 0001h
PIE7_PWM3IE_MASK                         equ 0080h

// Register: PIE8
#define PIE8 PIE8
PIE8                                     equ 04B2h
// bitfield definitions
PIE8_U2RXIE_POSN                         equ 0000h
PIE8_U2RXIE_POSITION                     equ 0000h
PIE8_U2RXIE_SIZE                         equ 0001h
PIE8_U2RXIE_LENGTH                       equ 0001h
PIE8_U2RXIE_MASK                         equ 0001h
PIE8_U2TXIE_POSN                         equ 0001h
PIE8_U2TXIE_POSITION                     equ 0001h
PIE8_U2TXIE_SIZE                         equ 0001h
PIE8_U2TXIE_LENGTH                       equ 0001h
PIE8_U2TXIE_MASK                         equ 0002h
PIE8_U2EIE_POSN                          equ 0002h
PIE8_U2EIE_POSITION                      equ 0002h
PIE8_U2EIE_SIZE                          equ 0001h
PIE8_U2EIE_LENGTH                        equ 0001h
PIE8_U2EIE_MASK                          equ 0004h
PIE8_U2IE_POSN                           equ 0003h
PIE8_U2IE_POSITION                       equ 0003h
PIE8_U2IE_SIZE                           equ 0001h
PIE8_U2IE_LENGTH                         equ 0001h
PIE8_U2IE_MASK                           equ 0008h
PIE8_CLC4IE_POSN                         equ 0005h
PIE8_CLC4IE_POSITION                     equ 0005h
PIE8_CLC4IE_SIZE                         equ 0001h
PIE8_CLC4IE_LENGTH                       equ 0001h
PIE8_CLC4IE_MASK                         equ 0020h
PIE8_CCP2IE_POSN                         equ 0006h
PIE8_CCP2IE_POSITION                     equ 0006h
PIE8_CCP2IE_SIZE                         equ 0001h
PIE8_CCP2IE_LENGTH                       equ 0001h
PIE8_CCP2IE_MASK                         equ 0040h
PIE8_SCANIE_POSN                         equ 0007h
PIE8_SCANIE_POSITION                     equ 0007h
PIE8_SCANIE_SIZE                         equ 0001h
PIE8_SCANIE_LENGTH                       equ 0001h
PIE8_SCANIE_MASK                         equ 0080h

// Register: PIE9
#define PIE9 PIE9
PIE9                                     equ 04B3h
// bitfield definitions
PIE9_C1IE_POSN                           equ 0000h
PIE9_C1IE_POSITION                       equ 0000h
PIE9_C1IE_SIZE                           equ 0001h
PIE9_C1IE_LENGTH                         equ 0001h
PIE9_C1IE_MASK                           equ 0001h
PIE9_DMA3SCNTIE_POSN                     equ 0004h
PIE9_DMA3SCNTIE_POSITION                 equ 0004h
PIE9_DMA3SCNTIE_SIZE                     equ 0001h
PIE9_DMA3SCNTIE_LENGTH                   equ 0001h
PIE9_DMA3SCNTIE_MASK                     equ 0010h
PIE9_DMA3DCNTIE_POSN                     equ 0005h
PIE9_DMA3DCNTIE_POSITION                 equ 0005h
PIE9_DMA3DCNTIE_SIZE                     equ 0001h
PIE9_DMA3DCNTIE_LENGTH                   equ 0001h
PIE9_DMA3DCNTIE_MASK                     equ 0020h
PIE9_DMA3ORIE_POSN                       equ 0006h
PIE9_DMA3ORIE_POSITION                   equ 0006h
PIE9_DMA3ORIE_SIZE                       equ 0001h
PIE9_DMA3ORIE_LENGTH                     equ 0001h
PIE9_DMA3ORIE_MASK                       equ 0040h
PIE9_DMA3AIE_POSN                        equ 0007h
PIE9_DMA3AIE_POSITION                    equ 0007h
PIE9_DMA3AIE_SIZE                        equ 0001h
PIE9_DMA3AIE_LENGTH                      equ 0001h
PIE9_DMA3AIE_MASK                        equ 0080h

// Register: PIE10
#define PIE10 PIE10
PIE10                                    equ 04B4h
// bitfield definitions
PIE10_INT2IE_POSN                        equ 0000h
PIE10_INT2IE_POSITION                    equ 0000h
PIE10_INT2IE_SIZE                        equ 0001h
PIE10_INT2IE_LENGTH                      equ 0001h
PIE10_INT2IE_MASK                        equ 0001h
PIE10_CLC8IE_POSN                        equ 0001h
PIE10_CLC8IE_POSITION                    equ 0001h
PIE10_CLC8IE_SIZE                        equ 0001h
PIE10_CLC8IE_LENGTH                      equ 0001h
PIE10_CLC8IE_MASK                        equ 0002h
PIE10_TU16BIE_POSN                       equ 0002h
PIE10_TU16BIE_POSITION                   equ 0002h
PIE10_TU16BIE_SIZE                       equ 0001h
PIE10_TU16BIE_LENGTH                     equ 0001h
PIE10_TU16BIE_MASK                       equ 0004h
PIE10_TMR4IE_POSN                        equ 0003h
PIE10_TMR4IE_POSITION                    equ 0003h
PIE10_TMR4IE_SIZE                        equ 0001h
PIE10_TMR4IE_LENGTH                      equ 0001h
PIE10_TMR4IE_MASK                        equ 0008h
PIE10_DMA4SCNTIE_POSN                    equ 0004h
PIE10_DMA4SCNTIE_POSITION                equ 0004h
PIE10_DMA4SCNTIE_SIZE                    equ 0001h
PIE10_DMA4SCNTIE_LENGTH                  equ 0001h
PIE10_DMA4SCNTIE_MASK                    equ 0010h
PIE10_DMA4DCNTIE_POSN                    equ 0005h
PIE10_DMA4DCNTIE_POSITION                equ 0005h
PIE10_DMA4DCNTIE_SIZE                    equ 0001h
PIE10_DMA4DCNTIE_LENGTH                  equ 0001h
PIE10_DMA4DCNTIE_MASK                    equ 0020h
PIE10_DMA4ORIE_POSN                      equ 0006h
PIE10_DMA4ORIE_POSITION                  equ 0006h
PIE10_DMA4ORIE_SIZE                      equ 0001h
PIE10_DMA4ORIE_LENGTH                    equ 0001h
PIE10_DMA4ORIE_MASK                      equ 0040h
PIE10_DMA4AIE_POSN                       equ 0007h
PIE10_DMA4AIE_POSITION                   equ 0007h
PIE10_DMA4AIE_SIZE                       equ 0001h
PIE10_DMA4AIE_LENGTH                     equ 0001h
PIE10_DMA4AIE_MASK                       equ 0080h

