garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.inc
// Register: PIE11
#define PIE11 PIE11
PIE11                                    equ 04B5h
// bitfield definitions
PIE11_SPI2RXIE_POSN                      equ 0000h
PIE11_SPI2RXIE_POSITION                  equ 0000h
PIE11_SPI2RXIE_SIZE                      equ 0001h
PIE11_SPI2RXIE_LENGTH                    equ 0001h
PIE11_SPI2RXIE_MASK                      equ 0001h
PIE11_SPI2TXIE_POSN                      equ 0001h
PIE11_SPI2TXIE_POSITION                  equ 0001h
PIE11_SPI2TXIE_SIZE                      equ 0001h
PIE11_SPI2TXIE_LENGTH                    equ 0001h
PIE11_SPI2TXIE_MASK                      equ 0002h
PIE11_SPI2IE_POSN                        equ 0002h
PIE11_SPI2IE_POSITION                    equ 0002h
PIE11_SPI2IE_SIZE                        equ 0001h
PIE11_SPI2IE_LENGTH                      equ 0001h
PIE11_SPI2IE_MASK                        equ 0004h
PIE11_VDDIO2LVDIE_POSN                   equ 0003h
PIE11_VDDIO2LVDIE_POSITION               equ 0003h
PIE11_VDDIO2LVDIE_SIZE                   equ 0001h
PIE11_VDDIO2LVDIE_LENGTH                 equ 0001h
PIE11_VDDIO2LVDIE_MASK                   equ 0008h
PIE11_VDDIO2nRDYIE_POSN                  equ 0004h
PIE11_VDDIO2nRDYIE_POSITION              equ 0004h
PIE11_VDDIO2nRDYIE_SIZE                  equ 0001h
PIE11_VDDIO2nRDYIE_LENGTH                equ 0001h
PIE11_VDDIO2nRDYIE_MASK                  equ 0010h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 04B6h
// bitfield definitions
PIR0_SWIF_POSN                           equ 0000h
PIR0_SWIF_POSITION                       equ 0000h
PIR0_SWIF_SIZE                           equ 0001h
PIR0_SWIF_LENGTH                         equ 0001h
PIR0_SWIF_MASK                           equ 0001h
PIR0_HLVDIF_POSN                         equ 0001h
PIR0_HLVDIF_POSITION                     equ 0001h
PIR0_HLVDIF_SIZE                         equ 0001h
PIR0_HLVDIF_LENGTH                       equ 0001h
PIR0_HLVDIF_MASK                         equ 0002h
PIR0_OSFIF_POSN                          equ 0002h
PIR0_OSFIF_POSITION                      equ 0002h
PIR0_OSFIF_SIZE                          equ 0001h
PIR0_OSFIF_LENGTH                        equ 0001h
PIR0_OSFIF_MASK                          equ 0004h
PIR0_CSWIF_POSN                          equ 0003h
PIR0_CSWIF_POSITION                      equ 0003h
PIR0_CSWIF_SIZE                          equ 0001h
PIR0_CSWIF_LENGTH                        equ 0001h
PIR0_CSWIF_MASK                          equ 0008h
PIR0_NVMIF_POSN                          equ 0004h
PIR0_NVMIF_POSITION                      equ 0004h
PIR0_NVMIF_SIZE                          equ 0001h
PIR0_NVMIF_LENGTH                        equ 0001h
PIR0_NVMIF_MASK                          equ 0010h
PIR0_CLC1IF_POSN                         equ 0005h
PIR0_CLC1IF_POSITION                     equ 0005h
PIR0_CLC1IF_SIZE                         equ 0001h
PIR0_CLC1IF_LENGTH                       equ 0001h
PIR0_CLC1IF_MASK                         equ 0020h
PIR0_CRCIF_POSN                          equ 0006h
PIR0_CRCIF_POSITION                      equ 0006h
PIR0_CRCIF_SIZE                          equ 0001h
PIR0_CRCIF_LENGTH                        equ 0001h
PIR0_CRCIF_MASK                          equ 0040h
PIR0_IOCIF_POSN                          equ 0007h
PIR0_IOCIF_POSITION                      equ 0007h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0080h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 04B7h
// bitfield definitions
PIR1_INT0IF_POSN                         equ 0000h
PIR1_INT0IF_POSITION                     equ 0000h
PIR1_INT0IF_SIZE                         equ 0001h
PIR1_INT0IF_LENGTH                       equ 0001h
PIR1_INT0IF_MASK                         equ 0001h
PIR1_ADTIF_POSN                          equ 0001h
PIR1_ADTIF_POSITION                      equ 0001h
PIR1_ADTIF_SIZE                          equ 0001h
PIR1_ADTIF_LENGTH                        equ 0001h
PIR1_ADTIF_MASK                          equ 0002h
PIR1_ADIF_POSN                           equ 0002h
PIR1_ADIF_POSITION                       equ 0002h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0004h
PIR1_ACTIF_POSN                          equ 0003h
PIR1_ACTIF_POSITION                      equ 0003h
PIR1_ACTIF_SIZE                          equ 0001h
PIR1_ACTIF_LENGTH                        equ 0001h
PIR1_ACTIF_MASK                          equ 0008h
PIR1_I2C2RXIF_POSN                       equ 0004h
PIR1_I2C2RXIF_POSITION                   equ 0004h
PIR1_I2C2RXIF_SIZE                       equ 0001h
PIR1_I2C2RXIF_LENGTH                     equ 0001h
PIR1_I2C2RXIF_MASK                       equ 0010h
PIR1_I2C2TXIF_POSN                       equ 0005h
PIR1_I2C2TXIF_POSITION                   equ 0005h
PIR1_I2C2TXIF_SIZE                       equ 0001h
PIR1_I2C2TXIF_LENGTH                     equ 0001h
PIR1_I2C2TXIF_MASK                       equ 0020h
PIR1_I2C2IF_POSN                         equ 0006h
PIR1_I2C2IF_POSITION                     equ 0006h
PIR1_I2C2IF_SIZE                         equ 0001h
PIR1_I2C2IF_LENGTH                       equ 0001h
PIR1_I2C2IF_MASK                         equ 0040h
PIR1_I2C2EIF_POSN                        equ 0007h
PIR1_I2C2EIF_POSITION                    equ 0007h
PIR1_I2C2EIF_SIZE                        equ 0001h
PIR1_I2C2EIF_LENGTH                      equ 0001h
PIR1_I2C2EIF_MASK                        equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 04B8h
// bitfield definitions
PIR2_ZCD2IF_POSN                         equ 0000h
PIR2_ZCD2IF_POSITION                     equ 0000h
PIR2_ZCD2IF_SIZE                         equ 0001h
PIR2_ZCD2IF_LENGTH                       equ 0001h
PIR2_ZCD2IF_MASK                         equ 0001h
PIR2_CLC5IF_POSN                         equ 0001h
PIR2_CLC5IF_POSITION                     equ 0001h
PIR2_CLC5IF_SIZE                         equ 0001h
PIR2_CLC5IF_LENGTH                       equ 0001h
PIR2_CLC5IF_MASK                         equ 0002h
PIR2_IOCSRIF_POSN                        equ 0002h
PIR2_IOCSRIF_POSITION                    equ 0002h
PIR2_IOCSRIF_SIZE                        equ 0001h
PIR2_IOCSRIF_LENGTH                      equ 0001h
PIR2_IOCSRIF_MASK                        equ 0004h
PIR2_ZCD1IF_POSN                         equ 0003h
PIR2_ZCD1IF_POSITION                     equ 0003h
PIR2_ZCD1IF_SIZE                         equ 0001h
PIR2_ZCD1IF_LENGTH                       equ 0001h
PIR2_ZCD1IF_MASK                         equ 0008h
PIR2_DMA1SCNTIF_POSN                     equ 0004h
PIR2_DMA1SCNTIF_POSITION                 equ 0004h
PIR2_DMA1SCNTIF_SIZE                     equ 0001h
PIR2_DMA1SCNTIF_LENGTH                   equ 0001h
PIR2_DMA1SCNTIF_MASK                     equ 0010h
PIR2_DMA1DCNTIF_POSN                     equ 0005h
PIR2_DMA1DCNTIF_POSITION                 equ 0005h
PIR2_DMA1DCNTIF_SIZE                     equ 0001h
PIR2_DMA1DCNTIF_LENGTH                   equ 0001h
PIR2_DMA1DCNTIF_MASK                     equ 0020h
PIR2_DMA1ORIF_POSN                       equ 0006h
PIR2_DMA1ORIF_POSITION                   equ 0006h
PIR2_DMA1ORIF_SIZE                       equ 0001h
PIR2_DMA1ORIF_LENGTH                     equ 0001h
PIR2_DMA1ORIF_MASK                       equ 0040h
PIR2_DMA1AIF_POSN                        equ 0007h
PIR2_DMA1AIF_POSITION                    equ 0007h
PIR2_DMA1AIF_SIZE                        equ 0001h
PIR2_DMA1AIF_LENGTH                      equ 0001h
PIR2_DMA1AIF_MASK                        equ 0080h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 04B9h
// bitfield definitions
PIR3_SPI1RXIF_POSN                       equ 0000h
PIR3_SPI1RXIF_POSITION                   equ 0000h
PIR3_SPI1RXIF_SIZE                       equ 0001h
PIR3_SPI1RXIF_LENGTH                     equ 0001h
PIR3_SPI1RXIF_MASK                       equ 0001h
PIR3_SPI1TXIF_POSN                       equ 0001h
PIR3_SPI1TXIF_POSITION                   equ 0001h
PIR3_SPI1TXIF_SIZE                       equ 0001h
PIR3_SPI1TXIF_LENGTH                     equ 0001h
PIR3_SPI1TXIF_MASK                       equ 0002h
PIR3_SPI1IF_POSN                         equ 0002h
PIR3_SPI1IF_POSITION                     equ 0002h
PIR3_SPI1IF_SIZE                         equ 0001h
PIR3_SPI1IF_LENGTH                       equ 0001h
PIR3_SPI1IF_MASK                         equ 0004h
PIR3_TMR2IF_POSN                         equ 0003h
PIR3_TMR2IF_POSITION                     equ 0003h
PIR3_TMR2IF_SIZE                         equ 0001h
PIR3_TMR2IF_LENGTH                       equ 0001h
PIR3_TMR2IF_MASK                         equ 0008h
PIR3_TMR1IF_POSN                         equ 0004h
PIR3_TMR1IF_POSITION                     equ 0004h
PIR3_TMR1IF_SIZE                         equ 0001h
PIR3_TMR1IF_LENGTH                       equ 0001h
PIR3_TMR1IF_MASK                         equ 0010h
PIR3_TMR1GIF_POSN                        equ 0005h
PIR3_TMR1GIF_POSITION                    equ 0005h
PIR3_TMR1GIF_SIZE                        equ 0001h
PIR3_TMR1GIF_LENGTH                      equ 0001h
PIR3_TMR1GIF_MASK                        equ 0020h
PIR3_CCP1IF_POSN                         equ 0006h
PIR3_CCP1IF_POSITION                     equ 0006h
PIR3_CCP1IF_SIZE                         equ 0001h
PIR3_CCP1IF_LENGTH                       equ 0001h
PIR3_CCP1IF_MASK                         equ 0040h
PIR3_TMR0IF_POSN                         equ 0007h
PIR3_TMR0IF_POSITION                     equ 0007h
PIR3_TMR0IF_SIZE                         equ 0001h
PIR3_TMR0IF_LENGTH                       equ 0001h
PIR3_TMR0IF_MASK                         equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 04BAh
// bitfield definitions
PIR4_U1RXIF_POSN                         equ 0000h
PIR4_U1RXIF_POSITION                     equ 0000h
PIR4_U1RXIF_SIZE                         equ 0001h
PIR4_U1RXIF_LENGTH                       equ 0001h
PIR4_U1RXIF_MASK                         equ 0001h
PIR4_U1TXIF_POSN                         equ 0001h
PIR4_U1TXIF_POSITION                     equ 0001h
PIR4_U1TXIF_SIZE                         equ 0001h
PIR4_U1TXIF_LENGTH                       equ 0001h
PIR4_U1TXIF_MASK                         equ 0002h
PIR4_U1EIF_POSN                          equ 0002h
PIR4_U1EIF_POSITION                      equ 0002h
PIR4_U1EIF_SIZE                          equ 0001h
PIR4_U1EIF_LENGTH                        equ 0001h
PIR4_U1EIF_MASK                          equ 0004h
PIR4_U1IF_POSN                           equ 0003h
PIR4_U1IF_POSITION                       equ 0003h
PIR4_U1IF_SIZE                           equ 0001h
PIR4_U1IF_LENGTH                         equ 0001h
PIR4_U1IF_MASK                           equ 0008h
PIR4_TMR3IF_POSN                         equ 0004h
PIR4_TMR3IF_POSITION                     equ 0004h
PIR4_TMR3IF_SIZE                         equ 0001h
PIR4_TMR3IF_LENGTH                       equ 0001h
PIR4_TMR3IF_MASK                         equ 0010h
PIR4_TMR3GIF_POSN                        equ 0005h
PIR4_TMR3GIF_POSITION                    equ 0005h
PIR4_TMR3GIF_SIZE                        equ 0001h
PIR4_TMR3GIF_LENGTH                      equ 0001h
PIR4_TMR3GIF_MASK                        equ 0020h
PIR4_PWM1PIF_POSN                        equ 0006h
PIR4_PWM1PIF_POSITION                    equ 0006h
PIR4_PWM1PIF_SIZE                        equ 0001h
PIR4_PWM1PIF_LENGTH                      equ 0001h
PIR4_PWM1PIF_MASK                        equ 0040h
PIR4_PWM1IF_POSN                         equ 0007h
PIR4_PWM1IF_POSITION                     equ 0007h
PIR4_PWM1IF_SIZE                         equ 0001h
PIR4_PWM1IF_LENGTH                       equ 0001h
PIR4_PWM1IF_MASK                         equ 0080h

