garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.inc
#define ASYNC                            BANKMASK(T0CON1), 4, b
#define BASE0                            BANKMASK(IVTBASEL), 0, b
#define BASE1                            BANKMASK(IVTBASEL), 1, b
#define BASE10                           BANKMASK(IVTBASEH), 2, b
#define BASE11                           BANKMASK(IVTBASEH), 3, b
#define BASE12                           BANKMASK(IVTBASEH), 4, b
#define BASE13                           BANKMASK(IVTBASEH), 5, b
#define BASE14                           BANKMASK(IVTBASEH), 6, b
#define BASE15                           BANKMASK(IVTBASEH), 7, b
#define BASE16                           BANKMASK(IVTBASEU), 0, b
#define BASE17                           BANKMASK(IVTBASEU), 1, b
#define BASE18                           BANKMASK(IVTBASEU), 2, b
#define BASE19                           BANKMASK(IVTBASEU), 3, b
#define BASE2                            BANKMASK(IVTBASEL), 2, b
#define BASE20                           BANKMASK(IVTBASEU), 4, b
#define BASE3                            BANKMASK(IVTBASEL), 3, b
#define BASE4                            BANKMASK(IVTBASEL), 4, b
#define BASE5                            BANKMASK(IVTBASEL), 5, b
#define BASE6                            BANKMASK(IVTBASEL), 6, b
#define BASE7                            BANKMASK(IVTBASEL), 7, b
#define BASE8                            BANKMASK(IVTBASEH), 0, b
#define BASE9                            BANKMASK(IVTBASEH), 1, b
#define BCL1IE                           BANKMASK(I2C1ERR), 1, b
#define BCL1IF                           BANKMASK(I2C1ERR), 5, b
#define BCL2IE                           BANKMASK(I2C2ERR), 1, b
#define BCL2IF                           BANKMASK(I2C2ERR), 5, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define BTO1IE                           BANKMASK(I2C1ERR), 2, b
#define BTO1IF                           BANKMASK(I2C1ERR), 6, b
#define BTO2IE                           BANKMASK(I2C2ERR), 2, b
#define BTO2IF                           BANKMASK(I2C2ERR), 6, b
#define BUF0                             BANKMASK(DMAnBUF), 0, b
#define BUF1                             BANKMASK(DMAnBUF), 1, b
#define BUF2                             BANKMASK(DMAnBUF), 2, b
#define BUF3                             BANKMASK(DMAnBUF), 3, b
#define BUF4                             BANKMASK(DMAnBUF), 4, b
#define BUF5                             BANKMASK(DMAnBUF), 5, b
#define BUF6                             BANKMASK(DMAnBUF), 6, b
#define BUF7                             BANKMASK(DMAnBUF), 7, b
#define BURSTMD                          BANKMASK(SCANCON0), 1, b
#define C0EN                             BANKMASK(U1CON2), 3, b
#define C1EN                             BANKMASK(CM1CON0), 7, b
#define C1HYS                            BANKMASK(CM1CON0), 1, b
#define C1HYS1                           BANKMASK(CM1CON0), 2, b
#define C1IE                             BANKMASK(PIE9), 0, a
#define C1IF                             BANKMASK(PIR9), 0, a
#define C1INTN                           BANKMASK(CM1CON1), 0, b
#define C1INTP                           BANKMASK(CM1CON1), 1, b
#define C1IP                             BANKMASK(IPR9), 0, a
#define C1NCH0                           BANKMASK(CM1NCH), 0, b
#define C1NCH1                           BANKMASK(CM1NCH), 1, b
#define C1NCH2                           BANKMASK(CM1NCH), 2, b
#define C1OUT                            BANKMASK(CM1CON0), 6, b
#define C1PCH0                           BANKMASK(CM1PCH), 0, b
#define C1PCH1                           BANKMASK(CM1PCH), 1, b
#define C1PCH2                           BANKMASK(CM1PCH), 2, b
#define C1POL                            BANKMASK(CM1CON0), 4, b
#define C1RDY                            BANKMASK(CM1CON1), 7, b
#define C1SP0                            BANKMASK(CM1CON1), 2, b
#define C1SP1                            BANKMASK(CM1CON1), 3, b
#define C1SYNC                           BANKMASK(CM1CON0), 0, b
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C2EN                             BANKMASK(CM2CON0), 7, b
#define C2HYS                            BANKMASK(CM2CON0), 1, b
#define C2HYS1                           BANKMASK(CM2CON0), 2, b
#define C2IE                             BANKMASK(PIE5), 4, a
#define C2IF                             BANKMASK(PIR5), 4, a
#define C2INTN                           BANKMASK(CM2CON1), 0, b
#define C2INTP                           BANKMASK(CM2CON1), 1, b
#define C2IP                             BANKMASK(IPR5), 4, a
#define C2NCH0                           BANKMASK(CM2NCH), 0, b
#define C2NCH1                           BANKMASK(CM2NCH), 1, b
#define C2NCH2                           BANKMASK(CM2NCH), 2, b
#define C2OUT                            BANKMASK(CM2CON0), 6, b
#define C2PCH0                           BANKMASK(CM2PCH), 0, b
#define C2PCH1                           BANKMASK(CM2PCH), 1, b
#define C2PCH2                           BANKMASK(CM2PCH), 2, b
#define C2POL                            BANKMASK(CM2CON0), 4, b
#define C2RDY                            BANKMASK(CM2CON1), 7, b
#define C2SP0                            BANKMASK(CM2CON1), 2, b
#define C2SP1                            BANKMASK(CM2CON1), 3, b
#define C2SYNC                           BANKMASK(CM2CON0), 0, b
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3, b
#define CALC0                            BANKMASK(ADCON3), 4, b
#define CALC1                            BANKMASK(ADCON3), 5, b
#define CALC2                            BANKMASK(ADCON3), 6, b
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, b
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, b
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2, b
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3, b
#define CCP1EN                           BANKMASK(CCP1CON), 7, b
#define CCP1FMT                          BANKMASK(CCP1CON), 4, b
#define CCP1IE                           BANKMASK(PIE3), 6, a
#define CCP1IF                           BANKMASK(PIR3), 6, a
#define CCP1IP                           BANKMASK(IPR3), 6, a
#define CCP1MD                           BANKMASK(PMD2), 6, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, b
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, b
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, b
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, b
#define CCP1OUT                          BANKMASK(CCP1CON), 5, b
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0, b
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1, b
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2, b
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3, b
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4, b
#define CCP1PPS5                         BANKMASK(CCP1PPS), 5, b
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0, b
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1, b
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2, b
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3, b
#define CCP2EN                           BANKMASK(CCP2CON), 7, b
#define CCP2FMT                          BANKMASK(CCP2CON), 4, b
#define CCP2IE                           BANKMASK(PIE8), 6, a
#define CCP2IF                           BANKMASK(PIR8), 6, a
#define CCP2IP                           BANKMASK(IPR8), 6, a
#define CCP2MD                           BANKMASK(PMD2), 7, b
#define CCP2MODE0                        BANKMASK(CCP2CON), 0, b
#define CCP2MODE1                        BANKMASK(CCP2CON), 1, b
#define CCP2MODE2                        BANKMASK(CCP2CON), 2, b
#define CCP2MODE3                        BANKMASK(CCP2CON), 3, b
#define CCP2OUT                          BANKMASK(CCP2CON), 5, b
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0, b
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1, b
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2, b
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3, b
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4, b
#define CCP2PPS5                         BANKMASK(CCP2PPS), 5, b
#define CDAFVR0                          BANKMASK(FVRCON), 2, b
#define CDAFVR1                          BANKMASK(FVRCON), 3, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CGA0                             BANKMASK(ADCG1A), 0, b
#define CGA1                             BANKMASK(ADCG1A), 1, b
#define CGA2                             BANKMASK(ADCG1A), 2, b
#define CGA3                             BANKMASK(ADCG1A), 3, b
#define CGA4                             BANKMASK(ADCG1A), 4, b
#define CGA5                             BANKMASK(ADCG1A), 5, b
#define CGA6                             BANKMASK(ADCG1A), 6, b
#define CGA7                             BANKMASK(ADCG1A), 7, b
#define CGB0                             BANKMASK(ADCG1B), 0, b
#define CGB1                             BANKMASK(ADCG1B), 1, b
#define CGB2                             BANKMASK(ADCG1B), 2, b
#define CGB3                             BANKMASK(ADCG1B), 3, b
#define CGB4                             BANKMASK(ADCG1B), 4, b
#define CGB5                             BANKMASK(ADCG1B), 5, b
#define CGB6                             BANKMASK(ADCG1B), 6, b
#define CGB7                             BANKMASK(ADCG1B), 7, b
#define CGC0                             BANKMASK(ADCG1C), 0, b
#define CGC1                             BANKMASK(ADCG1C), 1, b
#define CGC2                             BANKMASK(ADCG1C), 2, b
#define CH16AB                           BANKMASK(TUCHAIN), 0, b
#define CKPS3                            BANKMASK(T0CON1), 3, b
#define CKS0                             BANKMASK(NCO1CLK), 0, b
#define CKS1                             BANKMASK(NCO1CLK), 1, b
#define CKS2                             BANKMASK(NCO1CLK), 2, b
#define CKS3                             BANKMASK(NCO1CLK), 3, b
#define CKS4                             BANKMASK(NCO1CLK), 4, b
#define CLC1IE                           BANKMASK(PIE0), 5, a
#define CLC1IF                           BANKMASK(PIR0), 5, a
#define CLC1IP                           BANKMASK(IPR0), 5, a
#define CLC1MD                           BANKMASK(PMD4), 1, b
#define CLC1OUT                          BANKMASK(CLCDATA), 0, b
#define CLC2IE                           BANKMASK(PIE5), 5, a
#define CLC2IF                           BANKMASK(PIR5), 5, a
#define CLC2IP                           BANKMASK(IPR5), 5, a
#define CLC2MD                           BANKMASK(PMD4), 2, b
#define CLC2OUT                          BANKMASK(CLCDATA), 1, b
#define CLC3IE                           BANKMASK(PIE7), 5, a
#define CLC3IF                           BANKMASK(PIR7), 5, a
#define CLC3IP                           BANKMASK(IPR7), 5, a
#define CLC3MD                           BANKMASK(PMD4), 3, b
#define CLC3OUT                          BANKMASK(CLCDATA), 2, b
#define CLC4IE                           BANKMASK(PIE8), 5, a
#define CLC4IF                           BANKMASK(PIR8), 5, a
#define CLC4IP                           BANKMASK(IPR8), 5, a
#define CLC4MD                           BANKMASK(PMD4), 4, b
#define CLC4OUT                          BANKMASK(CLCDATA), 3, b
#define CLC5IE                           BANKMASK(PIE2), 1, a
#define CLC5IF                           BANKMASK(PIR2), 1, a
#define CLC5IP                           BANKMASK(IPR2), 1, a
#define CLC5MD                           BANKMASK(PMD5), 4, b
#define CLC5OUT                          BANKMASK(CLCDATA), 4, b
#define CLC6IE                           BANKMASK(PIE5), 1, a
#define CLC6IF                           BANKMASK(PIR5), 1, a
#define CLC6IP                           BANKMASK(IPR5), 1, a
#define CLC6MD                           BANKMASK(PMD5), 5, b
#define CLC6OUT                          BANKMASK(CLCDATA), 5, b
#define CLC7IE                           BANKMASK(PIE6), 1, a
#define CLC7IF                           BANKMASK(PIR6), 1, a
#define CLC7IP                           BANKMASK(IPR6), 1, a
#define CLC7MD                           BANKMASK(PMD5), 6, b
#define CLC7OUT                          BANKMASK(CLCDATA), 6, b
#define CLC8IE                           BANKMASK(PIE10), 1, a
#define CLC8IF                           BANKMASK(PIR10), 1, a
#define CLC8IP                           BANKMASK(IPR10), 1, a
#define CLC8MD                           BANKMASK(PMD5), 7, b
#define CLC8OUT                          BANKMASK(CLCDATA), 7, b
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0, b
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1, b
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2, b
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3, b
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4, b
#define CLCIN0PPS5                       BANKMASK(CLCIN0PPS), 5, b
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0, b
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1, b
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2, b
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3, b
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4, b
#define CLCIN1PPS5                       BANKMASK(CLCIN1PPS), 5, b
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0, b
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1, b
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2, b
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3, b
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4, b
#define CLCIN2PPS5                       BANKMASK(CLCIN2PPS), 5, b
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0, b
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1, b
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2, b
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3, b
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4, b
#define CLCIN3PPS5                       BANKMASK(CLCIN3PPS), 5, b
#define CLCIN4PPS0                       BANKMASK(CLCIN4PPS), 0, b
#define CLCIN4PPS1                       BANKMASK(CLCIN4PPS), 1, b
#define CLCIN4PPS2                       BANKMASK(CLCIN4PPS), 2, b
#define CLCIN4PPS3                       BANKMASK(CLCIN4PPS), 3, b
#define CLCIN4PPS4                       BANKMASK(CLCIN4PPS), 4, b
#define CLCIN4PPS5                       BANKMASK(CLCIN4PPS), 5, b
#define CLCIN5PPS0                       BANKMASK(CLCIN5PPS), 0, b
#define CLCIN5PPS1                       BANKMASK(CLCIN5PPS), 1, b
#define CLCIN5PPS2                       BANKMASK(CLCIN5PPS), 2, b
#define CLCIN5PPS3                       BANKMASK(CLCIN5PPS), 3, b
#define CLCIN5PPS4                       BANKMASK(CLCIN5PPS), 4, b
#define CLCIN5PPS5                       BANKMASK(CLCIN5PPS), 5, b
#define CLCIN6PPS0                       BANKMASK(CLCIN6PPS), 0, b
#define CLCIN6PPS1                       BANKMASK(CLCIN6PPS), 1, b
#define CLCIN6PPS2                       BANKMASK(CLCIN6PPS), 2, b
#define CLCIN6PPS3                       BANKMASK(CLCIN6PPS), 3, b
#define CLCIN6PPS4                       BANKMASK(CLCIN6PPS), 4, b
#define CLCIN6PPS5                       BANKMASK(CLCIN6PPS), 5, b
#define CLCIN7PPS0                       BANKMASK(CLCIN7PPS), 0, b
#define CLCIN7PPS1                       BANKMASK(CLCIN7PPS), 1, b
#define CLCIN7PPS2                       BANKMASK(CLCIN7PPS), 2, b
#define CLCIN7PPS3                       BANKMASK(CLCIN7PPS), 3, b
#define CLCIN7PPS4                       BANKMASK(CLCIN7PPS), 4, b
#define CLCIN7PPS5                       BANKMASK(CLCIN7PPS), 5, b
#define CLKEN                            BANKMASK(PORTWCON), 0, b
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD0), 1, b
#define CM1MD                            BANKMASK(PMD1), 7, b
#define CM2MD                            BANKMASK(PMD2), 0, b
#define CNT1IE                           BANKMASK(I2C1PIE), 7, b
#define CNT1IF                           BANKMASK(I2C1PIR), 7, b
#define CNT2IE                           BANKMASK(I2C2PIE), 7, b
#define CNT2IF                           BANKMASK(I2C2PIR), 7, b
#define CONT                             BANKMASK(ADCON0), 6, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CRCBUSY                          BANKMASK(CRCCON0), 5, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE0), 6, a
#define CRCIF                            BANKMASK(PIR0), 6, a
#define CRCIP                            BANKMASK(IPR0), 6, a
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
#define CRS2                             BANKMASK(ADCON2), 6, b
#define CS5                              BANKMASK(ADCLK), 5, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE0), 3, a
#define CSWIF                            BANKMASK(PIR0), 3, a
#define CSWIP                            BANKMASK(IPR0), 3, a
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE6), 2, a
#define CWG1IF                           BANKMASK(PIR6), 2, a
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1INPPS0                       BANKMASK(CWG1PPS), 0, b
#define CWG1INPPS1                       BANKMASK(CWG1PPS), 1, b
#define CWG1INPPS2                       BANKMASK(CWG1PPS), 2, b
#define CWG1INPPS3                       BANKMASK(CWG1PPS), 3, b
#define CWG1INPPS4                       BANKMASK(CWG1PPS), 4, b
#define CWG1INPPS5                       BANKMASK(CWG1PPS), 5, b
#define CWG1IP                           BANKMASK(IPR6), 2, a
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1LSDB0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSDB1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD2), 5, b
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWGINPPS0                        BANKMASK(CWG1PPS), 0, b
#define CWGINPPS1                        BANKMASK(CWG1PPS), 1, b
#define CWGINPPS2                        BANKMASK(CWG1PPS), 2, b
#define CWGINPPS3                        BANKMASK(CWG1PPS), 3, b
#define CWGINPPS4                        BANKMASK(CWG1PPS), 4, b
#define CWGINPPS5                        BANKMASK(CWG1PPS), 5, b
#define D1S0                             BANKMASK(CLCnSEL0), 0, b
#define D1S1                             BANKMASK(CLCnSEL0), 1, b
#define D1S2                             BANKMASK(CLCnSEL0), 2, b
#define D1S3                             BANKMASK(CLCnSEL0), 3, b
#define D1S4                             BANKMASK(CLCnSEL0), 4, b
#define D1S5                             BANKMASK(CLCnSEL0), 5, b
#define D2S0                             BANKMASK(CLCnSEL1), 0, b
#define D2S1                             BANKMASK(CLCnSEL1), 1, b
#define D2S2                             BANKMASK(CLCnSEL1), 2, b
#define D2S3                             BANKMASK(CLCnSEL1), 3, b
#define D2S4                             BANKMASK(CLCnSEL1), 4, b
#define D2S5                             BANKMASK(CLCnSEL1), 5, b
#define D3S0                             BANKMASK(CLCnSEL2), 0, b
#define D3S1                             BANKMASK(CLCnSEL2), 1, b
#define D3S2                             BANKMASK(CLCnSEL2), 2, b
#define D3S3                             BANKMASK(CLCnSEL2), 3, b
#define D3S4                             BANKMASK(CLCnSEL2), 4, b
#define D3S5                             BANKMASK(CLCnSEL2), 5, b
#define D4S0                             BANKMASK(CLCnSEL3), 0, b
#define D4S1                             BANKMASK(CLCnSEL3), 1, b
#define D4S2                             BANKMASK(CLCnSEL3), 2, b
#define D4S3                             BANKMASK(CLCnSEL3), 3, b
#define D4S4                             BANKMASK(CLCnSEL3), 4, b
#define D4S5                             BANKMASK(CLCnSEL3), 5, b
#define DAC1EN                           BANKMASK(DAC1CON), 7, b
#define DAC1MD                           BANKMASK(PMD2), 2, b
#define DAC1PSS0                         BANKMASK(DAC1CON), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON), 3, b
#define DAC1R0                           BANKMASK(DAC1DATL), 0, b
