garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f24q24.inc
#define RA1PPS5                          BANKMASK(RA1PPS), 5, b
#define RA2                              BANKMASK(PORTA), 2, b
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA2PPS5                          BANKMASK(RA2PPS), 5, b
#define RA3                              BANKMASK(PORTA), 3, b
#define RA3PPS0                          BANKMASK(RA3PPS), 0, b
#define RA3PPS1                          BANKMASK(RA3PPS), 1, b
#define RA3PPS2                          BANKMASK(RA3PPS), 2, b
#define RA3PPS3                          BANKMASK(RA3PPS), 3, b
#define RA3PPS4                          BANKMASK(RA3PPS), 4, b
#define RA3PPS5                          BANKMASK(RA3PPS), 5, b
#define RA4                              BANKMASK(PORTA), 4, b
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA4PPS5                          BANKMASK(RA4PPS), 5, b
#define RA5                              BANKMASK(PORTA), 5, b
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA5PPS5                          BANKMASK(RA5PPS), 5, b
#define RA6                              BANKMASK(PORTA), 6, b
#define RA6PPS0                          BANKMASK(RA6PPS), 0, b
#define RA6PPS1                          BANKMASK(RA6PPS), 1, b
#define RA6PPS2                          BANKMASK(RA6PPS), 2, b
#define RA6PPS3                          BANKMASK(RA6PPS), 3, b
#define RA6PPS4                          BANKMASK(RA6PPS), 4, b
#define RA6PPS5                          BANKMASK(RA6PPS), 5, b
#define RA7                              BANKMASK(PORTA), 7, b
#define RA7PPS0                          BANKMASK(RA7PPS), 0, b
#define RA7PPS1                          BANKMASK(RA7PPS), 1, b
#define RA7PPS2                          BANKMASK(RA7PPS), 2, b
#define RA7PPS3                          BANKMASK(RA7PPS), 3, b
#define RA7PPS4                          BANKMASK(RA7PPS), 4, b
#define RA7PPS5                          BANKMASK(RA7PPS), 5, b
#define RB0                              BANKMASK(PORTB), 0, b
#define RB0PPS0                          BANKMASK(RB0PPS), 0, b
#define RB0PPS1                          BANKMASK(RB0PPS), 1, b
#define RB0PPS2                          BANKMASK(RB0PPS), 2, b
#define RB0PPS3                          BANKMASK(RB0PPS), 3, b
#define RB0PPS4                          BANKMASK(RB0PPS), 4, b
#define RB0PPS5                          BANKMASK(RB0PPS), 5, b
#define RB1                              BANKMASK(PORTB), 1, b
#define RB1PPS0                          BANKMASK(RB1PPS), 0, b
#define RB1PPS1                          BANKMASK(RB1PPS), 1, b
#define RB1PPS2                          BANKMASK(RB1PPS), 2, b
#define RB1PPS3                          BANKMASK(RB1PPS), 3, b
#define RB1PPS4                          BANKMASK(RB1PPS), 4, b
#define RB1PPS5                          BANKMASK(RB1PPS), 5, b
#define RB2                              BANKMASK(PORTB), 2, b
#define RB2PPS0                          BANKMASK(RB2PPS), 0, b
#define RB2PPS1                          BANKMASK(RB2PPS), 1, b
#define RB2PPS2                          BANKMASK(RB2PPS), 2, b
#define RB2PPS3                          BANKMASK(RB2PPS), 3, b
#define RB2PPS4                          BANKMASK(RB2PPS), 4, b
#define RB2PPS5                          BANKMASK(RB2PPS), 5, b
#define RB3                              BANKMASK(PORTB), 3, b
#define RB3PPS0                          BANKMASK(RB3PPS), 0, b
#define RB3PPS1                          BANKMASK(RB3PPS), 1, b
#define RB3PPS2                          BANKMASK(RB3PPS), 2, b
#define RB3PPS3                          BANKMASK(RB3PPS), 3, b
#define RB3PPS4                          BANKMASK(RB3PPS), 4, b
#define RB3PPS5                          BANKMASK(RB3PPS), 5, b
#define RB4                              BANKMASK(PORTB), 4, b
#define RB4PPS0                          BANKMASK(RB4PPS), 0, b
#define RB4PPS1                          BANKMASK(RB4PPS), 1, b
#define RB4PPS2                          BANKMASK(RB4PPS), 2, b
#define RB4PPS3                          BANKMASK(RB4PPS), 3, b
#define RB4PPS4                          BANKMASK(RB4PPS), 4, b
#define RB4PPS5                          BANKMASK(RB4PPS), 5, b
#define RB5                              BANKMASK(PORTB), 5, b
#define RB5PPS0                          BANKMASK(RB5PPS), 0, b
#define RB5PPS1                          BANKMASK(RB5PPS), 1, b
#define RB5PPS2                          BANKMASK(RB5PPS), 2, b
#define RB5PPS3                          BANKMASK(RB5PPS), 3, b
#define RB5PPS4                          BANKMASK(RB5PPS), 4, b
#define RB5PPS5                          BANKMASK(RB5PPS), 5, b
#define RB6                              BANKMASK(PORTB), 6, b
#define RB6PPS0                          BANKMASK(RB6PPS), 0, b
#define RB6PPS1                          BANKMASK(RB6PPS), 1, b
#define RB6PPS2                          BANKMASK(RB6PPS), 2, b
#define RB6PPS3                          BANKMASK(RB6PPS), 3, b
#define RB6PPS4                          BANKMASK(RB6PPS), 4, b
#define RB6PPS5                          BANKMASK(RB6PPS), 5, b
#define RB7                              BANKMASK(PORTB), 7, b
#define RB7PPS0                          BANKMASK(RB7PPS), 0, b
#define RB7PPS1                          BANKMASK(RB7PPS), 1, b
#define RB7PPS2                          BANKMASK(RB7PPS), 2, b
#define RB7PPS3                          BANKMASK(RB7PPS), 3, b
#define RB7PPS4                          BANKMASK(RB7PPS), 4, b
#define RB7PPS5                          BANKMASK(RB7PPS), 5, b
#define RC0                              BANKMASK(PORTC), 0, b
#define RC0PPS0                          BANKMASK(RC0PPS), 0, b
#define RC0PPS1                          BANKMASK(RC0PPS), 1, b
#define RC0PPS2                          BANKMASK(RC0PPS), 2, b
#define RC0PPS3                          BANKMASK(RC0PPS), 3, b
#define RC0PPS4                          BANKMASK(RC0PPS), 4, b
#define RC0PPS5                          BANKMASK(RC0PPS), 5, b
#define RC1                              BANKMASK(PORTC), 1, b
#define RC1PPS0                          BANKMASK(RC1PPS), 0, b
#define RC1PPS1                          BANKMASK(RC1PPS), 1, b
#define RC1PPS2                          BANKMASK(RC1PPS), 2, b
#define RC1PPS3                          BANKMASK(RC1PPS), 3, b
#define RC1PPS4                          BANKMASK(RC1PPS), 4, b
#define RC1PPS5                          BANKMASK(RC1PPS), 5, b
#define RC2                              BANKMASK(PORTC), 2, b
#define RC2PPS0                          BANKMASK(RC2PPS), 0, b
#define RC2PPS1                          BANKMASK(RC2PPS), 1, b
#define RC2PPS2                          BANKMASK(RC2PPS), 2, b
#define RC2PPS3                          BANKMASK(RC2PPS), 3, b
#define RC2PPS4                          BANKMASK(RC2PPS), 4, b
#define RC2PPS5                          BANKMASK(RC2PPS), 5, b
#define RC3                              BANKMASK(PORTC), 3, b
#define RC3PPS0                          BANKMASK(RC3PPS), 0, b
#define RC3PPS1                          BANKMASK(RC3PPS), 1, b
#define RC3PPS2                          BANKMASK(RC3PPS), 2, b
#define RC3PPS3                          BANKMASK(RC3PPS), 3, b
#define RC3PPS4                          BANKMASK(RC3PPS), 4, b
#define RC3PPS5                          BANKMASK(RC3PPS), 5, b
#define RC4                              BANKMASK(PORTC), 4, b
#define RC4PPS0                          BANKMASK(RC4PPS), 0, b
#define RC4PPS1                          BANKMASK(RC4PPS), 1, b
#define RC4PPS2                          BANKMASK(RC4PPS), 2, b
#define RC4PPS3                          BANKMASK(RC4PPS), 3, b
#define RC4PPS4                          BANKMASK(RC4PPS), 4, b
#define RC4PPS5                          BANKMASK(RC4PPS), 5, b
#define RC5                              BANKMASK(PORTC), 5, b
#define RC5PPS0                          BANKMASK(RC5PPS), 0, b
#define RC5PPS1                          BANKMASK(RC5PPS), 1, b
#define RC5PPS2                          BANKMASK(RC5PPS), 2, b
#define RC5PPS3                          BANKMASK(RC5PPS), 3, b
#define RC5PPS4                          BANKMASK(RC5PPS), 4, b
#define RC5PPS5                          BANKMASK(RC5PPS), 5, b
#define RC6                              BANKMASK(PORTC), 6, b
#define RC6PPS0                          BANKMASK(RC6PPS), 0, b
#define RC6PPS1                          BANKMASK(RC6PPS), 1, b
#define RC6PPS2                          BANKMASK(RC6PPS), 2, b
#define RC6PPS3                          BANKMASK(RC6PPS), 3, b
#define RC6PPS4                          BANKMASK(RC6PPS), 4, b
#define RC6PPS5                          BANKMASK(RC6PPS), 5, b
#define RC7                              BANKMASK(PORTC), 7, b
#define RC7PPS0                          BANKMASK(RC7PPS), 0, b
#define RC7PPS1                          BANKMASK(RC7PPS), 1, b
#define RC7PPS2                          BANKMASK(RC7PPS), 2, b
#define RC7PPS3                          BANKMASK(RC7PPS), 3, b
#define RC7PPS4                          BANKMASK(RC7PPS), 4, b
#define RC7PPS5                          BANKMASK(RC7PPS), 5, b
#define RC7PPS6                          BANKMASK(RC7PPS), 6, b
#define RC7PPS7                          BANKMASK(RC7PPS), 7, b
#define RD161                            BANKMASK(T1CON), 1, b
#define RD163                            BANKMASK(T3CON), 1, b
#define RE3                              BANKMASK(PORTE), 3, b
#define REN                              BANKMASK(CWG1AS0), 6, b
#define RES0                             BANKMASK(ADRESL), 0, b
#define RES1                             BANKMASK(ADRESL), 1, b
#define RES10                            BANKMASK(ADRESH), 2, b
#define RES11                            BANKMASK(ADRESH), 3, b
#define RES12                            BANKMASK(ADRESH), 4, b
#define RES13                            BANKMASK(ADRESH), 5, b
#define RES14                            BANKMASK(ADRESH), 6, b
#define RES15                            BANKMASK(ADRESH), 7, b
#define RES2                             BANKMASK(ADRESL), 2, b
#define RES3                             BANKMASK(ADRESL), 3, b
#define RES4                             BANKMASK(ADRESL), 4, b
#define RES5                             BANKMASK(ADRESL), 5, b
#define RES6                             BANKMASK(ADRESL), 6, b
#define RES7                             BANKMASK(ADRESL), 7, b
#define RES8                             BANKMASK(ADRESH), 0, b
#define RES9                             BANKMASK(ADRESH), 1, b
#define RI                               BANKMASK(PCON0), 2, a
#define RMCLR                            BANKMASK(PCON0), 3, a
#define ROI                              BANKMASK(CPUDOZE), 5, a
#define RPT0                             BANKMASK(ADRPT), 0, b
#define RPT1                             BANKMASK(ADRPT), 1, b
#define RPT2                             BANKMASK(ADRPT), 2, b
#define RPT3                             BANKMASK(ADRPT), 3, b
#define RPT4                             BANKMASK(ADRPT), 4, b
#define RPT5                             BANKMASK(ADRPT), 5, b
#define RPT6                             BANKMASK(ADRPT), 6, b
#define RPT7                             BANKMASK(ADRPT), 7, b
#define RSC1IE                           BANKMASK(I2C1PIE), 1, b
#define RSC1IF                           BANKMASK(I2C1PIR), 1, b
#define RSC2IE                           BANKMASK(I2C2PIE), 1, b
#define RSC2IF                           BANKMASK(I2C2PIR), 1, b
#define RW0                              BANKMASK(PORTW), 0, b
#define RW1                              BANKMASK(PORTW), 1, b
#define RW2                              BANKMASK(PORTW), 2, b
#define RW3                              BANKMASK(PORTW), 3, b
#define RW4                              BANKMASK(PORTW), 4, b
#define RW5                              BANKMASK(PORTW), 5, b
#define RW6                              BANKMASK(PORTW), 6, b
#define RW7                              BANKMASK(PORTW), 7, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SC1IE                            BANKMASK(I2C1PIE), 0, b
#define SC1IF                            BANKMASK(I2C1PIR), 0, b
#define SC2IE                            BANKMASK(I2C2PIE), 0, b
#define SC2IF                            BANKMASK(I2C2PIR), 0, b
#define SCANEN                           BANKMASK(SCANCON0), 7, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE8), 7, a
#define SCANIF                           BANKMASK(PIR8), 7, a
#define SCANIP                           BANKMASK(IPR8), 7, a
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANPR0                          BANKMASK(SCANPR), 0, b
#define SCANPR1                          BANKMASK(SCANPR), 1, b
#define SCANPR2                          BANKMASK(SCANPR), 2, b
#define SCNT0                            BANKMASK(DMAnSCNTL), 0, b
#define SCNT1                            BANKMASK(DMAnSCNTL), 1, b
#define SCNT10                           BANKMASK(DMAnSCNTH), 2, b
#define SCNT11                           BANKMASK(DMAnSCNTH), 3, b
#define SCNT2                            BANKMASK(DMAnSCNTL), 2, b
#define SCNT3                            BANKMASK(DMAnSCNTL), 3, b
#define SCNT4                            BANKMASK(DMAnSCNTL), 4, b
#define SCNT5                            BANKMASK(DMAnSCNTL), 5, b
#define SCNT6                            BANKMASK(DMAnSCNTL), 6, b
#define SCNT7                            BANKMASK(DMAnSCNTL), 7, b
#define SCNT8                            BANKMASK(DMAnSCNTH), 0, b
#define SCNT9                            BANKMASK(DMAnSCNTH), 1, b
#define SEN                              BANKMASK(WDTCON0), 0, b
#define SETUP0                           BANKMASK(CRCCON0), 2, b
#define SETUP1                           BANKMASK(CRCCON0), 3, b
#define SGO                              BANKMASK(SCANCON0), 5, b
#define SHADLO                           BANKMASK(SHADCON), 0, b
#define SHIFT0                           BANKMASK(CRCSHFTL), 0, b
#define SHIFT1                           BANKMASK(CRCSHFTL), 1, b
#define SHIFT10                          BANKMASK(CRCSHFTH), 2, b
#define SHIFT11                          BANKMASK(CRCSHFTH), 3, b
#define SHIFT12                          BANKMASK(CRCSHFTH), 4, b
#define SHIFT13                          BANKMASK(CRCSHFTH), 5, b
#define SHIFT14                          BANKMASK(CRCSHFTH), 6, b
#define SHIFT15                          BANKMASK(CRCSHFTH), 7, b
#define SHIFT16                          BANKMASK(CRCSHFTU), 0, b
#define SHIFT17                          BANKMASK(CRCSHFTU), 1, b
#define SHIFT18                          BANKMASK(CRCSHFTU), 2, b
#define SHIFT19                          BANKMASK(CRCSHFTU), 3, b
#define SHIFT2                           BANKMASK(CRCSHFTL), 2, b
#define SHIFT20                          BANKMASK(CRCSHFTU), 4, b
#define SHIFT21                          BANKMASK(CRCSHFTU), 5, b
#define SHIFT22                          BANKMASK(CRCSHFTU), 6, b
#define SHIFT23                          BANKMASK(CRCSHFTU), 7, b
#define SHIFT24                          BANKMASK(CRCSHFTT), 0, b
#define SHIFT25                          BANKMASK(CRCSHFTT), 1, b
#define SHIFT26                          BANKMASK(CRCSHFTT), 2, b
#define SHIFT27                          BANKMASK(CRCSHFTT), 3, b
#define SHIFT28                          BANKMASK(CRCSHFTT), 4, b
#define SHIFT29                          BANKMASK(CRCSHFTT), 5, b
#define SHIFT3                           BANKMASK(CRCSHFTL), 3, b
#define SHIFT30                          BANKMASK(CRCSHFTT), 6, b
#define SHIFT31                          BANKMASK(CRCSHFTT), 7, b
#define SHIFT4                           BANKMASK(CRCSHFTL), 4, b
#define SHIFT5                           BANKMASK(CRCSHFTL), 5, b
#define SHIFT6                           BANKMASK(CRCSHFTL), 6, b
#define SHIFT7                           BANKMASK(CRCSHFTL), 7, b
#define SHIFT8                           BANKMASK(CRCSHFTH), 0, b
#define SHIFT9                           BANKMASK(CRCSHFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7, b
#define SIRQ0                            BANKMASK(DMAnSIRQ), 0, b
#define SIRQ1                            BANKMASK(DMAnSIRQ), 1, b
#define SIRQ2                            BANKMASK(DMAnSIRQ), 2, b
#define SIRQ3                            BANKMASK(DMAnSIRQ), 3, b
#define SIRQ4                            BANKMASK(DMAnSIRQ), 4, b
#define SIRQ5                            BANKMASK(DMAnSIRQ), 5, b
#define SIRQ6                            BANKMASK(DMAnSIRQ), 6, b
#define SIRQ7                            BANKMASK(DMAnSIRQ), 7, b
#define SIRQEN                           BANKMASK(DMAnCON0), 6, b
#define SLCT2                            BANKMASK(CLCSELECT), 2, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA3                            BANKMASK(SLRCONA), 3, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRA6                            BANKMASK(SLRCONA), 6, b
#define SLRA7                            BANKMASK(SLRCONA), 7, b
#define SLRB0                            BANKMASK(SLRCONB), 0, b
#define SLRB1                            BANKMASK(SLRCONB), 1, b
#define SLRB2                            BANKMASK(SLRCONB), 2, b
#define SLRB3                            BANKMASK(SLRCONB), 3, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRD0                            BANKMASK(SLRCOND), 0, b
#define SLRD1                            BANKMASK(SLRCOND), 1, b
#define SLRD2                            BANKMASK(SLRCOND), 2, b
#define SLRD3                            BANKMASK(SLRCOND), 3, b
#define SLRD4                            BANKMASK(SLRCOND), 4, b
#define SLRD5                            BANKMASK(SLRCOND), 5, b
#define SLRD6                            BANKMASK(SLRCOND), 6, b
#define SLRD7                            BANKMASK(SLRCOND), 7, b
#define SLRE0                            BANKMASK(SLRCONE), 0, b
#define SLRE1                            BANKMASK(SLRCONE), 1, b
#define SLRE2                            BANKMASK(SLRCONE), 2, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SP6                              BANKMASK(STKPTR), 6, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
